[
  {
    "name": "Aatrox",
    "class": "the Darkin Blade",
    "id": "Aatrox",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Aatrox.png",
    "abilities": {
      "Q": {
        "name": "The Darkin Blade",
        "description": "Aatrox slams his greatsword down, dealing physical damage. He can swing three times, each with a different area of effect.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AatroxQ.png"
      },
      "W": {
        "name": "Infernal Chains",
        "description": "Aatrox smashes the ground, dealing damage to the first enemy hit. Champions and large monsters have to leave the impact area quickly or they will be dragged to the center and take the damage again.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AatroxW.png"
      },
      "E": {
        "name": "Umbral Dash",
        "description": "Passively, Aatrox heals when damaging enemy champions. On activation, he dashes in a direction.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AatroxE.png"
      },
      "R": {
        "name": "World Ender",
        "description": "Aatrox unleashes his demonic form, fearing nearby enemy minions and gaining attack damage, increased healing, and Move Speed. If he gets a takedown, this effect is extended.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AatroxR.png"
      }
    }
  },
  {
    "name": "Ahri",
    "class": "the Nine-Tailed Fox",
    "id": "Ahri",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Ahri.png",
    "abilities": {
      "Q": {
        "name": "Orb of Deception",
        "description": "Ahri sends out and pulls back her orb, dealing magic damage on the way out and true damage on the way back. ",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AhriQ.png"
      },
      "W": {
        "name": "Fox-Fire",
        "description": "Ahri gains a brief burst of Move Speed and releases three fox-fires, that lock onto and attack nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AhriW.png"
      },
      "E": {
        "name": "Charm",
        "description": "Ahri blows a kiss that damages and charms an enemy it encounters, instantly stopping movement abilities and causing them to walk harmlessly towards her.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AhriE.png"
      },
      "R": {
        "name": "Spirit Rush",
        "description": "Ahri dashes forward and fires essence bolts, damaging nearby enemies. Spirit Rush can be cast up to three times before going on cooldown, and gains additional recasts when taking down enemy champions.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AhriR.png"
      }
    }
  },
  {
    "name": "Akali",
    "class": "the Rogue Assassin",
    "id": "Akali",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Akali.png",
    "abilities": {
      "Q": {
        "name": "Five Point Strike",
        "description": "Akali throws out five kunai, dealing damage based on her bonus Attack Damage and Ability Power and slowing.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AkaliQ.png"
      },
      "W": {
        "name": "Twilight Shroud",
        "description": "Akali drops a cover of smoke and briefly gains Move Speed. While inside the shroud, Akali becomes invisible and unable to be selected by enemy spells and attacks. Attacking or using abilities will briefly reveal her.  ",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AkaliW.png"
      },
      "E": {
        "name": "Shuriken Flip",
        "description": "Flip backward and fire a shuriken forward, dealing magic damage. The first enemy or smoke cloud hit is marked. Re-cast to dash to the marked target, dealing additional damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AkaliE.png"
      },
      "R": {
        "name": "Perfect Execution",
        "description": "Akali leaps in a direction, damaging enemies she strikes. Re-cast: Akali dashes in a direction, executing all enemies she strikes.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AkaliR.png"
      }
    }
  },
  {
    "name": "Akshan",
    "class": "the Rogue Sentinel",
    "id": "Akshan",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Akshan.png",
    "abilities": {
      "Q": {
        "name": "Avengerang",
        "description": "Akshan throws a boomerang that deals damage going out and coming back, extending its range each time it hits an enemy.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AkshanQ.png"
      },
      "W": {
        "name": "Going Rogue",
        "description": "Akshan passively marks enemy champions as Scoundrels when they kill his ally champions. If Akshan kills a Scoundrel, he resurrects the allies they killed, gains bonus gold, and clears all marks.<br><br>When activated, Akshan enters camouflage and gains Move Speed and Mana Regen while moving towards Scoundrels. Akshan loses the camouflage quickly while he is not in brush or near terrain.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AkshanW.png"
      },
      "E": {
        "name": "Heroic Swing",
        "description": "Akshan fires a grappling hook into terrain then swings around it, repeatedly firing at the nearest enemy while swinging. He can jump off early or gets knocked off when colliding with champions or terrain.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AkshanE.png"
      },
      "R": {
        "name": "Comeuppance",
        "description": "Akshan locks onto an enemy champion and starts storing bullets. When released, he fires all stored bullets, dealing damage based on missing health to the first champion, minion, or structure hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AkshanR.png"
      }
    }
  },
  {
    "name": "Alistar",
    "class": "the Minotaur",
    "id": "Alistar",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Alistar.png",
    "abilities": {
      "Q": {
        "name": "Pulverize",
        "description": "Alistar smashes the ground, dealing damage to nearby enemies and tossing them into the air.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Pulverize.png"
      },
      "W": {
        "name": "Headbutt",
        "description": "Alistar rams a target with his head, dealing damage and knocking the target back.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Headbutt.png"
      },
      "E": {
        "name": "Trample",
        "description": "Alistar tramples nearby enemy units, ignoring unit collision and gaining stacks if he damages an enemy champion. At full stacks Alistar's next basic attack against an enemy champion deals additional magic damage and stuns them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AlistarE.png"
      },
      "R": {
        "name": "Unbreakable Will",
        "description": "Alistar lets out a wild roar, removing all crowd control effects on himself, and reducing incoming physical and magical damage for the duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FerociousHowl.png"
      }
    }
  },
  {
    "name": "Ambessa",
    "class": "Matriarch of War",
    "id": "Ambessa",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Ambessa.png",
    "abilities": {
      "Q": {
        "name": "Cunning Sweep / Sundering Slam",
        "description": "Ambessa sweeps her twin drakehounds in a semicircle in front of her, dealing bonus damage to enemies hit by the blades. Striking an enemy will transform the next cast of this ability for a short period of time, causing her to slam her twin drakehounds down in a line in front of her, dealing bonus damage to the first enemy hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AmbessaQ.png"
      },
      "W": {
        "name": "Repudiation",
        "description": "Ambessa gains a shield, briefly braces herself, and then slams the ground to damage nearby enemies. If she blocked any non-minion damage while bracing herself, this ability will deal increased damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AmbessaW.png"
      },
      "E": {
        "name": "Lacerate",
        "description": "Ambessa whips her twin drakehounds around herself, damaging and slowing nearby enemies. Initiating Drakehound's Step from this ability causes her to strike a second time at the end of its dash.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AmbessaE.png"
      },
      "R": {
        "name": "Public Execution",
        "description": "Ambessa blinks to the farthest enemy champion in a line of her choosing and suppresses them upon her arrival. She then slams the enemy into the ground where they take damage and are stunned.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AmbessaR.png"
      }
    }
  },
  {
    "name": "Amumu",
    "class": "the Sad Mummy",
    "id": "Amumu",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Amumu.png",
    "abilities": {
      "Q": {
        "name": "Bandage Toss",
        "description": "Amumu tosses a sticky bandage at a target, stunning and damaging the target while he pulls himself to them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BandageToss.png"
      },
      "W": {
        "name": "Despair",
        "description": "Overcome by anguish, nearby enemies lose a percentage of their maximum Health each second and have their <font color='#9b0f5f'>Curses</font> refreshed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AuraofDespair.png"
      },
      "E": {
        "name": "Tantrum",
        "description": "Permanently reduces the physical damage Amumu would take. Amumu can unleash his rage, dealing damage to surrounding enemies. Each time Amumu is hit, the cooldown on Tantrum is reduced.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Tantrum.png"
      },
      "R": {
        "name": "Curse of the Sad Mummy",
        "description": "Amumu entangles surrounding enemy units in bandages, applying his <keywordMajor>Curse</keywordMajor>, damaging and stunning them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CurseoftheSadMummy.png"
      }
    }
  },
  {
    "name": "Anivia",
    "class": "the Cryophoenix",
    "id": "Anivia",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Anivia.png",
    "abilities": {
      "Q": {
        "name": "Flash Frost",
        "description": "Anivia brings her wings together and summons a sphere of ice that flies towards her opponents, chilling and damaging anyone in its path. When the sphere explodes it does moderate damage in a radius, stunning anyone in the area.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FlashFrost.png"
      },
      "W": {
        "name": "Crystallize",
        "description": "Anivia condenses the moisture in the air into an impassable wall of ice to block all movement. The wall only lasts a short duration before it melts.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Crystallize.png"
      },
      "E": {
        "name": "Frostbite",
        "description": "With a flap of her wings, Anivia blasts a freezing gust of wind at her target, dealing damage. If the target was recently hit by Flash Frost or damaged by a fully formed Glacial Storm, the damage they take is doubled.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Frostbite.png"
      },
      "R": {
        "name": "Glacial Storm",
        "description": "Anivia summons a driving rain of ice and hail to damage her enemies and slow their advance.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GlacialStorm.png"
      }
    }
  },
  {
    "name": "Annie",
    "class": "the Dark Child",
    "id": "Annie",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Annie.png",
    "abilities": {
      "Q": {
        "name": "Disintegrate",
        "description": "Annie hurls a Mana infused fireball, dealing damage and refunding the Mana cost if it destroys the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AnnieQ.png"
      },
      "W": {
        "name": "Incinerate",
        "description": "Annie casts a blazing cone of fire, dealing damage to all enemies in the area.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AnnieW.png"
      },
      "E": {
        "name": "Molten Shield",
        "description": "Grants Annie or an ally a shield, a burst of Move Speed, and damages enemies who strike her with attacks or spells.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AnnieE.png"
      },
      "R": {
        "name": "Summon: Tibbers",
        "description": "Annie wills her bear Tibbers to life, dealing damage to units in the area. Tibbers can attack and also burns enemies that stand near him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AnnieR.png"
      }
    }
  },
  {
    "name": "Aphelios",
    "class": "the Weapon of the Faithful",
    "id": "Aphelios",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Aphelios.png",
    "abilities": {
      "Q": {
        "name": "Weapon Abilites",
        "description": "Aphelios has 5 different activated abilities, based on his main-hand weapon:<br><br>Calibrum (Rifle): Long range shot that marks its target for a long-range follow-up attack.<br>Severum (Scythe Pistol): Run fast while attacking nearby enemies with both weapons.<br>Gravitum (Cannon): Root all enemies slowed by this weapon.<br>Infernum (Flamethrower): Blast enemies in a cone and attack them with your off-hand weapon.<br>Crescendum (Chakram): Deploy a sentry that shoots your off-hand weapon.<br>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ApheliosQ_ClientTooltipWrapper.png"
      },
      "W": {
        "name": "Phase",
        "description": "Aphelios swaps his main-hand gun with his off-hand gun, replacing his basic attack and activated ability.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ApheliosW.png"
      },
      "E": {
        "name": "Weapon Queue System",
        "description": "Aphelios has no third ability. This slot shows the next weapon Alune will give him. Weapon order begins fixed but may change over game time -- when a weapon is out of ammo it goes to the end of the order.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ApheliosE_ClientTooltipWrapper.png"
      },
      "R": {
        "name": "Moonlight Vigil",
        "description": "Fire a concentrated blast of moonlight that explodes on enemy champions. Applies the unique effect of Aphelios' main-hand gun.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ApheliosR.png"
      }
    }
  },
  {
    "name": "Ashe",
    "class": "the Frost Archer",
    "id": "Ashe",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Ashe.png",
    "abilities": {
      "Q": {
        "name": "Ranger's Focus",
        "description": "Ashe builds up Focus by attacking. At maximum Focus, Ashe can cast Ranger's Focus to consume all stacks of Focus, temporarily increasing her Attack Speed and transforming her basic attack into a powerful flurry attack for the duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AsheQ.png"
      },
      "W": {
        "name": "Volley",
        "description": "Ashe fires arrows in a cone for increased damage. Also applies Frost Shot.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Volley.png"
      },
      "E": {
        "name": "Hawkshot",
        "description": "Ashe sends her Hawk Spirit on a scouting mission anywhere on the map.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AsheSpiritOfTheHawk.png"
      },
      "R": {
        "name": "Enchanted Crystal Arrow",
        "description": "Ashe fires a missile of ice in a straight line. If the arrow collides with an enemy Champion, it deals damage and stuns the Champion, stunning for longer the farther arrow has traveled. In addition, surrounding enemy units take damage and are slowed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EnchantedCrystalArrow.png"
      }
    }
  },
  {
    "name": "Aurelion Sol",
    "class": "The Star Forger",
    "id": "AurelionSol",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/AurelionSol.png",
    "abilities": {
      "Q": {
        "name": "Breath of Light",
        "description": "Aurelion Sol channels his dragon breath for a few seconds, damaging the first enemy hit and splashing reduced damage onto nearby enemies. Each second the breath is channeled directly at an enemy will deal bonus damage, which is improved by the amount of Stardust that's been collected. This ability collects Stardust if the target is a champion.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AurelionSolQ.png"
      },
      "W": {
        "name": "Astral Flight",
        "description": "Aurelion Sol flies over terrain in a targeted direction. While in this state, he can cast other abilities. Breath of Light no longer has a cooldown or maximum channel duration and deals increased damage while flying.<br><br>Astral Flight's remaining cooldown is reduced whenever an enemy champion dies after being recently damaged by Aurelion Sol.<br><br>Stardust increases Astral Flight's maximum range.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AurelionSolW.png"
      },
      "E": {
        "name": "Singularity",
        "description": "Aurelion Sol summons a black hole, damaging enemies and slowly pulling them toward its center. This ability grants Stardust each time an enemy dies within the black hole and for each second an enemy champion is caught inside it. The center of the black hole executes enemies who are below a certain percentage of their maximum health. Stardust increases Singularity's area as well as the execution threshold.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AurelionSolE.png"
      },
      "R": {
        "name": "Falling Star / The Skies Descend",
        "description": "Falling Star: Aurelion Sol crashes a star into the earth. This impact deals magic damage and stuns enemies while also granting Stardust for each enemy champion it hits. Gathering enough Stardust transforms Aurelion Sol's next Falling Star into The Skies Descend.<br><br>The Skies Descend: Aurelion Sol drags a giant star down from the heavens with an increased impact zone and increased damage, knocking up enemies rather than stunning them. A shockwave then spreads from the edge of the impact zone, which damages and slows the enemies it hits. Stardust increases the impact area of both Falling Star and The Skies Descend.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AurelionSolR.png"
      }
    }
  },
  {
    "name": "Aurora",
    "class": "the Witch Between Worlds",
    "id": "Aurora",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Aurora.png",
    "abilities": {
      "Q": {
        "name": "Twofold Hex",
        "description": "Aurora sends out a missile that curses any enemies it hits. She can then recast the ability to draw active curses back toward herself, damaging foes who are hit along the way.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AuroraQ.png"
      },
      "W": {
        "name": "Across the Veil",
        "description": "Aurora leaps in a direction of her choosing, entering the spirit realm upon landing, becoming invisible, and gaining Move Speed for a short duration of time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AuroraW.png"
      },
      "E": {
        "name": "The Weirding",
        "description": "Aurora converges the realms, sending out a blast of spirit magic that damages and slows enemies before Aurora hops backward to safety.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AuroraE.png"
      },
      "R": {
        "name": "Between Worlds",
        "description": "Aurora leaps in a direction of her choosing, releasing a shockwave that damages and slows any enemies it hits. Afterward, she creates an area that slows enemies within it and allows Aurora to teleport from one side of the area to the other.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AuroraR.png"
      }
    }
  },
  {
    "name": "Azir",
    "class": "the Emperor of the Sands",
    "id": "Azir",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Azir.png",
    "abilities": {
      "Q": {
        "name": "Conquering Sands",
        "description": "Azir sends all Sand Soldiers towards a location. Sand Soldiers deal magic damage to enemies they pass through and apply a slow for 1 second.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AzirQWrapper.png"
      },
      "W": {
        "name": "Arise!",
        "description": "Azir summons a Sand Soldier to attack nearby targets for him, replacing his basic attack against targets within the soldier's range. Their attacks deal magic damage to enemies in a line.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AzirW.png"
      },
      "E": {
        "name": "Shifting Sands",
        "description": "Azir shields himself briefly and dashes to one of his Sand Soldiers, damaging enemies. If he hits an enemy champion, he instantly readies a new Sand Soldier for deployment and halts his dash.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AzirEWrapper.png"
      },
      "R": {
        "name": "Emperor's Divide",
        "description": "Azir summons a wall of soldiers which charge forward, knocking back and damaging enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AzirR.png"
      }
    }
  },
  {
    "name": "Bard",
    "class": "the Wandering Caretaker",
    "id": "Bard",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Bard.png",
    "abilities": {
      "Q": {
        "name": "Cosmic Binding",
        "description": "Bard fires a missile which will slow the first enemy struck, and continue onward. If it strikes a wall, it will stun the initial target; if it strikes another enemy, it will stun them both.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BardQ.png"
      },
      "W": {
        "name": "Caretaker's Shrine",
        "description": "Reveals a Health shrine which powers up over a short time, disappearing after healing and speeding up the first ally that touches it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BardW.png"
      },
      "E": {
        "name": "Magical Journey",
        "description": "Bard opens a portal in nearby terrain. Allies and enemies alike can take a one-way trip through that terrain by moving into the portal.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BardE.png"
      },
      "R": {
        "name": "Tempered Fate",
        "description": "Bard sends spirit energy arcing to a location, putting all champions, minions, monsters, and turrets hit into stasis for a brief time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BardR.png"
      }
    }
  },
  {
    "name": "Bel'Veth",
    "class": "the Empress of the Void",
    "id": "Belveth",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Belveth.png",
    "abilities": {
      "Q": {
        "name": "Void Surge",
        "description": "Bel'Veth dashes in a chosen direction and damages all enemies she passes through.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BelvethQ.png"
      },
      "W": {
        "name": "Above and Below",
        "description": "Bel'Veth slams her tail to the ground, damaging, knocking up, and slowing her enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BelvethW.png"
      },
      "E": {
        "name": "Royal Maelstrom",
        "description": "Bel'Veth roots herself in place, channeling a storm of slashes around her that targets the lowest-health enemy and grants her lifesteal and damage reduction.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BelvethE.png"
      },
      "R": {
        "name": "Endless Banquet",
        "description": "Bel'Veth consumes Void coral remnants, transforming into her true form and increasing her max health, attack range, attack speed, and out-of-combat move speed. Consuming the Void coral remnants of a Void epic monster will grant her a longer ultimate duration, as well as the power to summon Void remora.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BelvethR.png"
      }
    }
  },
  {
    "name": "Blitzcrank",
    "class": "the Great Steam Golem",
    "id": "Blitzcrank",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Blitzcrank.png",
    "abilities": {
      "Q": {
        "name": "Rocket Grab",
        "description": "Blitzcrank fires their right hand to grab an opponent on its path, dealing damage and dragging it back to them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RocketGrab.png"
      },
      "W": {
        "name": "Overdrive",
        "description": "Blitzcrank super charges themself to get dramatically increased Move and Attack Speed. They are temporarily slowed after the effect ends.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Overdrive.png"
      },
      "E": {
        "name": "Power Fist",
        "description": "Blitzcrank charges up their fist to make the next attack deal double damage and pop their target up in the air.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PowerFist.png"
      },
      "R": {
        "name": "Static Field",
        "description": "Enemies attacked by Blitzcrank are marked and take lightning damage after 1 second. Additionally, Blitzcrank can activate this ability to remove nearby enemies' shields, damage them, and silence them briefly.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/StaticField.png"
      }
    }
  },
  {
    "name": "Brand",
    "class": "the Burning Vengeance",
    "id": "Brand",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Brand.png",
    "abilities": {
      "Q": {
        "name": "Sear",
        "description": "Brand launches a ball of fire forward that deals magic damage. If the target is ablaze, Sear will stun the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BrandQ.png"
      },
      "W": {
        "name": "Pillar of Flame",
        "description": "After a short delay, Brand creates a Pillar of Flame at a target area, dealing magic damage to enemy units within the area. Units that are ablaze take an additional 25% damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BrandW.png"
      },
      "E": {
        "name": "Conflagration",
        "description": "Brand conjures a powerful blast at his target that spreads to nearby enemies, dealing magic damage. If the target is ablaze, Conflagration's spread is doubled.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BrandE.png"
      },
      "R": {
        "name": "Pyroclasm",
        "description": "Brand unleashes a devastating torrent of fire that bounces up to 5 times off of Brand and nearby enemies, dealing magic damage to enemies each time bounce. Bounces prioritize stacking Blaze to max on Champions. If a target is ablaze, Pyroclasm will briefly slow them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BrandR.png"
      }
    }
  },
  {
    "name": "Braum",
    "class": "the Heart of the Freljord",
    "id": "Braum",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Braum.png",
    "abilities": {
      "Q": {
        "name": "Winter's Bite",
        "description": "Braum propels freezing ice from his shield, slowing and dealing magic damage.<br><br>Applies a stack of <font color='#FFF673'>Concussive Blows</font>.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BraumQ.png"
      },
      "W": {
        "name": "Stand Behind Me",
        "description": "Braum leaps to a target allied champion or minion. On arrival, Braum and the ally gain Armor and Magic Resist for a few seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BraumW.png"
      },
      "E": {
        "name": "Unbreakable",
        "description": "Braum raises his shield in a direction for several seconds, intercepting all projectiles causing them to hit him and be destroyed. He negates the damage of the first attack completely and reduces the damage of all subsequent attacks from this direction.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BraumE.png"
      },
      "R": {
        "name": "Glacial Fissure",
        "description": "Braum slams the ground, knocking up enemies nearby and in a line in front of him. A fissure is left along the line that slows enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BraumRWrapper.png"
      }
    }
  },
  {
    "name": "Briar",
    "class": "the Restrained Hunger",
    "id": "Briar",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Briar.png",
    "abilities": {
      "Q": {
        "name": "Head Rush",
        "description": "Briar leaps to a unit and hits enemies with The Heel Wheel (of Pain), stunning them and breaking their Armor.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BriarQ.png"
      },
      "W": {
        "name": "Blood Frenzy / Snack Attack",
        "description": "Briar leaps forward and shatters her pillory, entering a Blood Frenzy that causes her to relentlessly pursue the nearest enemy (prioritizing champions). While frenzied, she gains increased Attack Speed and Move Speed, and her attacks deal damage in an area around her target.<br><br>Briar can reactivate this ability while frenzied to take a CHOMP out of her target on her next attack, dealing additional damage based on their missing Health, and healing Briar based on the damage she deals.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BriarW.png"
      },
      "E": {
        "name": "Chilling Scream",
        "description": "Briar refocuses her mind, removing Blood Frenzy and channeling energy into a powerful scream that damages and slows enemies. While charging, she takes reduced damage and heals for a portion of her max Health. A fully charged scream knocks foes back, dealing additional damage and stunning those who collide with a wall.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BriarE.png"
      },
      "R": {
        "name": "Certain Death",
        "description": "Briar kicks her pillory's hemolith gemstone, marking the first champion it hits as her prey. She then beelines straight to them, fearing other surrounding enemies upon arriving at her target, and enters a state of complete hemomania. She will pursue her prey until death, gaining the benefits of Blood Frenzy as well as additional Armor, Magic Resistance, Life Steal, and Move Speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/BriarR.png"
      }
    }
  },
  {
    "name": "Caitlyn",
    "class": "the Sheriff of Piltover",
    "id": "Caitlyn",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Caitlyn.png",
    "abilities": {
      "Q": {
        "name": "Piltover Peacemaker",
        "description": "Caitlyn revs up her rifle for 1 second to unleash a penetrating shot that deals physical damage (deals less damage to subsequent targets).",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CaitlynQ.png"
      },
      "W": {
        "name": "Yordle Snap Trap",
        "description": "Caitlyn sets a trap that, when sprung, reveals and immobilizes the enemy champion for 1.5 seconds, granting Caitlyn an empowered Headshot.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CaitlynW.png"
      },
      "E": {
        "name": "90 Caliber Net",
        "description": "Caitlyn fires a heavy net to slow her target. The recoil knocks Caitlyn back.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CaitlynE.png"
      },
      "R": {
        "name": "Ace in the Hole",
        "description": "Caitlyn takes time to line up the perfect shot, dealing massive damage to a single target at a huge range. Enemy champions can intercept the bullet for their ally.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CaitlynR.png"
      }
    }
  },
  {
    "name": "Camille",
    "class": "the Steel Shadow",
    "id": "Camille",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Camille.png",
    "abilities": {
      "Q": {
        "name": "Precision Protocol",
        "description": "Camille's next attack deals bonus damage and grants bonus Move Speed. This spell can be recast for a short period of time, doing significantly increased bonus damage if Camille delays a period of time between the two attacks.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CamilleQ.png"
      },
      "W": {
        "name": "Tactical Sweep",
        "description": "Camille blasts in a cone after a delay, dealing damage. Enemies in the outer half are slowed and take extra damage, while also healing Camille.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CamilleW.png"
      },
      "E": {
        "name": "Hookshot",
        "description": "Camille pulls herself to a wall, leaping off and knocking up enemy champions upon landing.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CamilleE.png"
      },
      "R": {
        "name": "The Hextech Ultimatum",
        "description": "Camille dashes to target champion, anchoring them to the area. She also deals bonus magic damage to the target with her basic attacks.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CamilleR.png"
      }
    }
  },
  {
    "name": "Cassiopeia",
    "class": "the Serpent's Embrace",
    "id": "Cassiopeia",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Cassiopeia.png",
    "abilities": {
      "Q": {
        "name": "Noxious Blast",
        "description": "Cassiopeia blasts an area with Poison after a brief delay, granting her increased Move Speed if she hits an enemy champion.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CassiopeiaQ.png"
      },
      "W": {
        "name": "Miasma",
        "description": "Cassiopeia releases several clouds of poison, slowing, grounding, and lightly damaging enemies that pass through them. Grounded enemies cannot use Movement abilities.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CassiopeiaW.png"
      },
      "E": {
        "name": "Twin Fang",
        "description": "Cassiopeia lets loose an attack that deals increased damage to Poisoned targets and heals her for a percentage of the damage dealt. If the target dies from this attack, Cassiopeia regains Mana.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CassiopeiaE.png"
      },
      "R": {
        "name": "Petrifying Gaze",
        "description": "Cassiopeia releases a swirl of magical energy from her eyes, stunning any enemies in front of her that are facing her and slowing any others with their back turned.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CassiopeiaR.png"
      }
    }
  },
  {
    "name": "Cho'Gath",
    "class": "the Terror of the Void",
    "id": "Chogath",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Chogath.png",
    "abilities": {
      "Q": {
        "name": "Rupture",
        "description": "Ruptures the ground at target location, popping enemy units into the air, dealing damage and slowing them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Rupture.png"
      },
      "W": {
        "name": "Feral Scream",
        "description": "Cho'Gath unleashes a terrible scream at enemies in a cone, dealing magic damage and Silencing enemies for a few seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FeralScream.png"
      },
      "E": {
        "name": "Vorpal Spikes",
        "description": "Cho'Gath's attacks release deadly spikes, dealing damage and slowing all enemy units in front of him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VorpalSpikes.png"
      },
      "R": {
        "name": "Feast",
        "description": "Devours an enemy unit, dealing a high amount of true damage. If the target is killed, Cho'Gath grows, gaining maximum Health.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Feast.png"
      }
    }
  },
  {
    "name": "Corki",
    "class": "the Daring Bombardier",
    "id": "Corki",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Corki.png",
    "abilities": {
      "Q": {
        "name": "Phosphorus Bomb",
        "description": "Corki fires a flash bomb at a target location, dealing magic damage to enemies in the area. This attack additionally reveals units in the area for a duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PhosphorusBomb.png"
      },
      "W": {
        "name": "Valkyrie",
        "description": "Corki flies a short distance, dropping bombs that create a trail of fire that damages opponents who remain in it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CarpetBomb.png"
      },
      "E": {
        "name": "Gatling Gun",
        "description": "Corki's gatling gun rapidly fires in a cone in front of him, dealing damage and reducing enemy Armor and Magic Resist.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GGun.png"
      },
      "R": {
        "name": "Missile Barrage",
        "description": "Corki fires a missile toward his target location that explodes on impact, dealing damage to enemies in an area. Corki stores missiles over time, up to a maximum. Every 3rd missile fired will be a Big One, dealing extra damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MissileBarrage.png"
      }
    }
  },
  {
    "name": "Darius",
    "class": "the Hand of Noxus",
    "id": "Darius",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Darius.png",
    "abilities": {
      "Q": {
        "name": "Decimate",
        "description": "Darius winds up and swings his axe in a wide circle. Enemies struck by the blade take more damage than those struck by the handle. Darius heals based on enemy champions and large monsters hit by the blade.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DariusCleave.png"
      },
      "W": {
        "name": "Crippling Strike",
        "description": "Darius's next attack strikes an enemy's crucial artery. As they bleed out, their Move Speed is slowed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DariusNoxianTacticsONH.png"
      },
      "E": {
        "name": "Apprehend",
        "description": "Darius hones his axe, passively causing his physical damage to ignore a percentage of his target's Armor. When activated, Darius sweeps up his enemies with his axe's hook and pulls them to him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DariusAxeGrabCone.png"
      },
      "R": {
        "name": "Noxian Guillotine",
        "description": "Darius leaps to an enemy champion and strikes a lethal blow, dealing true damage. This damage is increased for each stack of Hemorrhage on the target. If Noxian Guillotine is a killing blow, its cooldown is refreshed for a brief duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DariusExecute.png"
      }
    }
  },
  {
    "name": "Diana",
    "class": "Scorn of the Moon",
    "id": "Diana",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Diana.png",
    "abilities": {
      "Q": {
        "name": "Crescent Strike",
        "description": "Unleashes a bolt of lunar energy in an arc dealing magic damage.<br><br>Afflicts enemies struck with Moonlight, revealing them if they are not stealthed for 3 seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DianaQ.png"
      },
      "W": {
        "name": "Pale Cascade",
        "description": "Diana creates three orbiting spheres that detonate on contact with enemies to deal damage in an area. She also gains a temporary shield that absorbs damage. If her third sphere detonates, the shield gains additional strength.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DianaOrbs.png"
      },
      "E": {
        "name": "Lunar Rush",
        "description": "Becomes the living embodiment of the vengeful moon, dashing to an enemy and dealing magic damage.<br><br>Lunar Rush has no cooldown when used to dash to an enemy afflicted with Moonlight. All other enemies will have the Moonlight debuff removed regardless of whether they were the target of Lunar Rush.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DianaTeleport.png"
      },
      "R": {
        "name": "Moonfall",
        "description": "Diana reveals and draws in all nearby enemies and slows them.<br><br>If Diana pulls in one or more enemy champions, the moonlight crashes down onto her after a short delay, dealing magic damage in an area around her, increased for each target beyond the first pulled.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DianaR.png"
      }
    }
  },
  {
    "name": "Draven",
    "class": "the Glorious Executioner",
    "id": "Draven",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Draven.png",
    "abilities": {
      "Q": {
        "name": "Spinning Axe",
        "description": "Draven's next attack will deal bonus physical damage. This axe will ricochet off the target high up into the air. If Draven catches it, he automatically readies another Spinning Axe. Draven can have two Spinning Axes at once.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DravenSpinning.png"
      },
      "W": {
        "name": "Blood Rush",
        "description": "Draven gains increased Move Speed and Attack Speed. The Move Speed bonus decreases rapidly over its duration. Catching a Spinning Axe will refresh the cooldown of Blood Rush.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DravenFury.png"
      },
      "E": {
        "name": "Stand Aside",
        "description": "Draven throws his axes, dealing physical damage to targets hit and knocking them aside. Targets hit are slowed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DravenDoubleShot.png"
      },
      "R": {
        "name": "Whirling Death",
        "description": "Draven hurls two massive axes to deal physical damage to each unit struck. Whirling Death slowly reverses direction and returns to Draven after striking an enemy champion. Draven may also activate this ability while the axes are in flight to cause it to return early. Deals less damage for each unit hit and resets when the axes reverse direction. Executes enemies who have less health than Draven's number of Adoration stacks.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DravenRCast.png"
      }
    }
  },
  {
    "name": "Dr. Mundo",
    "class": "the Madman of Zaun",
    "id": "DrMundo",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/DrMundo.png",
    "abilities": {
      "Q": {
        "name": "Infected Bonesaw",
        "description": "Dr. Mundo throws an infected bonesaw, dealing damage to the first enemy hit based on their current health and slowing them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DrMundoQ.png"
      },
      "W": {
        "name": "Heart Zapper",
        "description": "Dr. Mundo electrocutes himself, dealing persistent damage to nearby enemies and storing a portion of damage he takes. At the end of the duration or on Recast, Dr. Mundo deals a burst of damage to nearby enemies. If the burst hit an enemy, he heals a percentage of the stored damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DrMundoW.png"
      },
      "E": {
        "name": "Blunt Force Trauma",
        "description": "Passive - Dr. Mundo gains bonus Attack Damage, increasing based on his max Health.<br><br>Active - Dr. Mundo slams his “medical” bag into an enemy, dealing additional damage based on his missing Health. If the enemy dies they are swatted away, dealing damage to enemies they pass through.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DrMundoE.png"
      },
      "R": {
        "name": "Maximum Dosage",
        "description": "Dr. Mundo pumps himself with chemicals, instantly healing a percent of his missing Health. He then gains Move Speed and regenerates a portion of his maximum Health over a long duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DrMundoR.png"
      }
    }
  },
  {
    "name": "Ekko",
    "class": "the Boy Who Shattered Time",
    "id": "Ekko",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Ekko.png",
    "abilities": {
      "Q": {
        "name": "Timewinder",
        "description": "Ekko throws a temporal grenade that expands into a time-distortion field upon hitting an enemy champion, slowing and damaging anyone caught inside. After a delay, the grenade rewinds back to Ekko, dealing damage on its return.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EkkoQ.png"
      },
      "W": {
        "name": "Parallel Convergence",
        "description": "Ekko's basic attacks deal bonus magic damage to low health enemies. He can cast Parallel Convergence to split the timeline, creating an anomaly after a few seconds that slows enemies caught inside. If Ekko enters the anomaly, he gains shielding and stuns enemies by suspending them in time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EkkoW.png"
      },
      "E": {
        "name": "Phase Dive",
        "description": "Ekko rolls evasively while charging up his Z-Drive. His next attack deals bonus damage and warps reality, teleporting him to his target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EkkoE.png"
      },
      "R": {
        "name": "Chronobreak",
        "description": "Ekko shatters his timeline, becoming untargetable and rewinding to a more favorable point in time. He returns to whenever he was a few seconds ago, and heals for a percentage of the damage received in that duration. Enemies near his arrival zone take massive damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EkkoR.png"
      }
    }
  },
  {
    "name": "Elise",
    "class": "the Spider Queen",
    "id": "Elise",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Elise.png",
    "abilities": {
      "Q": {
        "name": "Neurotoxin / Venomous Bite",
        "description": "Human Form: Deals damage based upon how high the target's Health is.<br><br>Spider Form: Lunges at an enemy and deals damage based upon how low their Health is.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EliseHumanQ.png"
      },
      "W": {
        "name": "Volatile Spiderling / Skittering Frenzy",
        "description": "Human Form: Releases a venom-gorged Spiderling that explodes when it nears a target.<br><br>Spider Form: Elise and her Spiderlings gain Attack Speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EliseHumanW.png"
      },
      "E": {
        "name": "Cocoon / Rappel",
        "description": "Human Form: Stuns the first enemy unit hit and reveals them if they are not stealthed.<br><br>Spider Form: Elise and her Spiderlings ascend into the air and then descend upon target enemy. After descending on an enemy target, Elise's bonus damage and healing from Spider Queen is increased.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EliseHumanE.png"
      },
      "R": {
        "name": "Spider Form",
        "description": "Transforms into a menacing spider, reducing her attack range in exchange for Move Speed, new abilities, and a Spiderling swarm that will attack her foes.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EliseR.png"
      }
    }
  },
  {
    "name": "Evelynn",
    "class": "Agony's Embrace",
    "id": "Evelynn",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Evelynn.png",
    "abilities": {
      "Q": {
        "name": "Hate Spike",
        "description": "Evelynn strikes out with her Lasher, dealing damage to the first unit hit. Then, Evelynn can shoot a line of spikes at nearby foes a few times.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EvelynnQ.png"
      },
      "W": {
        "name": "Allure",
        "description": "Evelynn curses her target, causing her next attack or spell after a delay to charm her target and reduce their magic resist.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EvelynnW.png"
      },
      "E": {
        "name": "Whiplash",
        "description": "Evelynn whips her target with her Lasher, dealing damage. She then gains Move Speed for a short duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EvelynnE.png"
      },
      "R": {
        "name": "Last Caress",
        "description": "Evelynn briefly goes untargetable and decimates the area in front of her before warping backwards a long distance.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EvelynnR.png"
      }
    }
  },
  {
    "name": "Ezreal",
    "class": "the Prodigal Explorer",
    "id": "Ezreal",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Ezreal.png",
    "abilities": {
      "Q": {
        "name": "Mystic Shot",
        "description": "Ezreal fires a damaging bolt of energy which reduces all of his cooldowns slightly if it strikes an enemy unit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EzrealQ.png"
      },
      "W": {
        "name": "Essence Flux",
        "description": "Ezreal fires an orb that sticks to the first champion or objective hit. If Ezreal hits an enemy with the orb, it detonates and deals damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EzrealW.png"
      },
      "E": {
        "name": "Arcane Shift",
        "description": "Ezreal teleports to a target nearby location and fires a homing bolt which strikes the nearest enemy unit. Prioritizes enemies stuck with Essence Flux.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EzrealE.png"
      },
      "R": {
        "name": "Trueshot Barrage",
        "description": "Ezreal winds up before firing a powerful barrage of energy that deals massive damage to each unit it passes through (damage is reduced for minions and non-epic monsters).",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EzrealR.png"
      }
    }
  },
  {
    "name": "Fiddlesticks",
    "class": "the Ancient Fear",
    "id": "Fiddlesticks",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Fiddlesticks.png",
    "abilities": {
      "Q": {
        "name": "Terrify",
        "description": "Fiddlesticks damaging enemies with spells while unseen or targeting an enemy with Terrify's activation strikes a target unit with fear, causing it to flee in terror for a duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FiddleSticksQ.png"
      },
      "W": {
        "name": "Bountiful Harvest",
        "description": "Fiddlesticks drains health from nearby enemies, dealing bonus execute damage at the end of the duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FiddleSticksW.png"
      },
      "E": {
        "name": "Reap",
        "description": "Fiddlesticks slashes an area with its scythe, slowing all enemies hit and silencing enemies hit in the center of the slash.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FiddleSticksE.png"
      },
      "R": {
        "name": "Crowstorm",
        "description": "A murder of crows flock wildly around Fiddlesticks, dealing damage per second to all enemy units in the area.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FiddleSticksR.png"
      }
    }
  },
  {
    "name": "Fiora",
    "class": "the Grand Duelist",
    "id": "Fiora",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Fiora.png",
    "abilities": {
      "Q": {
        "name": "Lunge",
        "description": "Fiora lunges in a direction and stabs a nearby enemy, dealing physical damage and applying on-hit effects.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FioraQ.png"
      },
      "W": {
        "name": "Riposte",
        "description": "Fiora parries all incoming damage and disables for a short time, then stabs in a direction. This stab slows the first enemy champion hit, or stuns them if Fiora blocked an immobilizing effect with this ability.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FioraW.png"
      },
      "E": {
        "name": "Bladework",
        "description": "Fiora has increased attack speed for the next two attacks. The first attack slows the target, and the second attack will critically strike.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FioraE.png"
      },
      "R": {
        "name": "Grand Challenge",
        "description": "Fiora reveals all four Vitals on an enemy champion and gains Move Speed while near them. If Fiora hits all four Vitals or if the target dies after she has hit at least one, Fiora and her allies in the area are healed over the next few seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FioraR.png"
      }
    }
  },
  {
    "name": "Fizz",
    "class": "the Tidal Trickster",
    "id": "Fizz",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Fizz.png",
    "abilities": {
      "Q": {
        "name": "Urchin Strike",
        "description": "Fizz dashes through his target, dealing magic damage and applying on hit effects.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FizzQ.png"
      },
      "W": {
        "name": "Seastone Trident",
        "description": "Fizz's attacks bleed his enemies, dealing magic damage over several seconds. Fizz can empower his next attack to deal bonus damage and empower his further attacks for a short time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FizzW.png"
      },
      "E": {
        "name": "Playful / Trickster",
        "description": "Fizz hops into the air, landing gracefully upon his spear and becoming untargetable. From this position, Fizz can either slam the ground or choose to jump again before smashing back down.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FizzE.png"
      },
      "R": {
        "name": "Chum the Waters",
        "description": "Fizz tosses a fish in a direction that attaches to any champion that touches it, slowing the target. After a short delay, a shark erupts from the ground, knocking up the target and knocking any nearby enemies aside. All enemies hit are dealt magic damage and slowed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/FizzR.png"
      }
    }
  },
  {
    "name": "Galio",
    "class": "the Colossus",
    "id": "Galio",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Galio.png",
    "abilities": {
      "Q": {
        "name": "Winds of War",
        "description": "Galio fires two windblasts that converge into a large tornado that deals damage over time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GalioQ.png"
      },
      "W": {
        "name": "Shield of Durand",
        "description": "Galio charges a defensive stance, moving slowly. Upon releasing the charge, Galio will taunt and damage nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GalioW.png"
      },
      "E": {
        "name": "Justice Punch",
        "description": "Galio will briefly step back and charge, knocking up the first enemy champion he encounters.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GalioE.png"
      },
      "R": {
        "name": "Hero's Entrance",
        "description": "Galio designates an ally's position as his landing spot, granting all allies in the area a magic shield. After a delay Galio smashes down location, knocking up nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GalioR.png"
      }
    }
  },
  {
    "name": "Gangplank",
    "class": "the Saltwater Scourge",
    "id": "Gangplank",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Gangplank.png",
    "abilities": {
      "Q": {
        "name": "Parrrley",
        "description": "Shoots target, plundering Gold for each enemy unit killed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GangplankQWrapper.png"
      },
      "W": {
        "name": "Remove Scurvy",
        "description": "Eats citrus to cure crowd control effects and restore Health.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GangplankW.png"
      },
      "E": {
        "name": "Powder Keg",
        "description": "Gangplank uncovers a powder keg at target location. If he attacks it, it explodes, spreading the attack's damage to enemies in the area, slowing them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GangplankE.png"
      },
      "R": {
        "name": "Cannon Barrage",
        "description": "Gangplank signals his ship to bombard an area, slowing and damaging enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GangplankR.png"
      }
    }
  },
  {
    "name": "Garen",
    "class": "The Might of Demacia",
    "id": "Garen",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Garen.png",
    "abilities": {
      "Q": {
        "name": "Decisive Strike",
        "description": "Garen gains a burst of Move Speed, breaking free of all slows affecting him. His next attack strikes a vital area of his foe, dealing bonus damage and silencing them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GarenQ.png"
      },
      "W": {
        "name": "Courage",
        "description": "Garen passively increases his Armor and Magic Resist by killing enemies. He may also activate this ability to give him a shield and tenacity for a brief moment followed by a lesser amount of damage reduction for a longer duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GarenW.png"
      },
      "E": {
        "name": "Judgment",
        "description": "Garen rapidly spins his sword around his body, dealing physical damage to nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GarenE.png"
      },
      "R": {
        "name": "Demacian Justice",
        "description": "Garen calls upon the might of Demacia to attempt to execute an enemy champion.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GarenR.png"
      }
    }
  },
  {
    "name": "Gnar",
    "class": "the Missing Link",
    "id": "Gnar",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Gnar.png",
    "abilities": {
      "Q": {
        "name": "Boomerang Throw / Boulder Toss",
        "description": "Gnar throws a boomerang that damages and slows enemies it hits before returning to him. If he catches the boomerang its cooldown is reduced.<br><br>Mega Gnar instead throws a boulder that stops on the first unit hit, damaging and slowing everything nearby. It can then be picked up to reduce the cooldown.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GnarQ.png"
      },
      "W": {
        "name": "Hyper / Wallop",
        "description": "Gnar's attacks and spells hype him up, dealing bonus damage and granting him Move Speed.<br><br>Mega Gnar is too enraged to be hyper and instead can rear up on his hind legs and smash down on the area in front of him, stunning enemies in an area.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GnarW.png"
      },
      "E": {
        "name": "Hop / Crunch",
        "description": "Gnar leaps to a location and bounces off the head of any unit he lands on, traveling further.<br><br>Mega Gnar is too large to bounce and instead lands with earth-shattering force, dealing damage in an area around him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GnarE.png"
      },
      "R": {
        "name": "GNAR!",
        "description": "Mega Gnar throws everything around him in a chosen direction, dealing damage and slowing them.  Any enemy that hits a wall is stunned and takes bonus damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GnarR.png"
      }
    }
  },
  {
    "name": "Gragas",
    "class": "the Rabble Rouser",
    "id": "Gragas",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Gragas.png",
    "abilities": {
      "Q": {
        "name": "Barrel Roll",
        "description": "Gragas rolls his cask to a location, which can be activated to explode or will explode on its own after 4 seconds. The potency of the explosion increases over time. Enemies struck by the blast have their Move Speed slowed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GragasQ.png"
      },
      "W": {
        "name": "Drunken Rage",
        "description": "Gragas samples his latest brew for 1 second. After finishing, he becomes boisterous and belligerent, dealing magic damage to all nearby enemies on his next basic attack and reducing damage received.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GragasW.png"
      },
      "E": {
        "name": "Body Slam",
        "description": "Gragas charges to a location and collides with the first enemy unit he comes across, dealing damage to all nearby enemy units and stunning them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GragasE.png"
      },
      "R": {
        "name": "Explosive Cask",
        "description": "Gragas hurls his cask to a location, dealing damage and knocking back enemies caught in the blast radius.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GragasR.png"
      }
    }
  },
  {
    "name": "Graves",
    "class": "the Outlaw",
    "id": "Graves",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Graves.png",
    "abilities": {
      "Q": {
        "name": "End of the Line",
        "description": "Graves fires an explosive shell that detonates after 1 second, or after colliding with terrain.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GravesQLineSpell.png"
      },
      "W": {
        "name": "Smoke Screen",
        "description": "Graves fires a smoke canister at the target area creating a cloud of smoke that reduces sight range. Enemies caught in the initial impact are dealt magic damage and have their Move Speed reduced briefly.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GravesSmokeGrenade.png"
      },
      "E": {
        "name": "Quickdraw",
        "description": "Graves dashes forward gaining an Armor and Magic Resist boost for several seconds. If Graves dashes towards an enemy champion, gain two stacks of True Grit instead. Hitting enemies with basic attacks lowers the cooldown of this skill and refreshes the resistance boost.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GravesMove.png"
      },
      "R": {
        "name": "Collateral Damage",
        "description": "Graves fires an explosive shell dealing heavy damage to the first champion it hits. After hitting a champion or reaching the end of its range, the shell explodes dealing damage in a cone.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GravesChargeShot.png"
      }
    }
  },
  {
    "name": "Gwen",
    "class": "The Hallowed Seamstress",
    "id": "Gwen",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Gwen.png",
    "abilities": {
      "Q": {
        "name": "Snip Snip!",
        "description": "Gwen snips her scissors in a cone up to 6 times dealing magic damage. Gwen deals true damage to units in the center and applies her passive to them on each snip.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GwenQ.png"
      },
      "W": {
        "name": "Hallowed Mist",
        "description": "Gwen summons mist that protects her from enemies outside of it. She can only be targeted by enemies who enter the mist.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GwenW.png"
      },
      "E": {
        "name": "Skip 'n Slash",
        "description": "Gwen dashes a short distance then gains Attack Speed, attack range, and magic damage <OnHit>On-Hit</OnHit> for a few seconds. If she hits an enemy during that time, this Ability's cooldown is partially refunded. ",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GwenE.png"
      },
      "R": {
        "name": "Needlework",
        "description": "Gwen hurls a needle that slows enemies hit, deals magic damage, and applies A Thousand Cuts to champions hit. <br><br>This ability can be cast up to two more times, with each cast throwing additional needles and dealing more damage. ",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/GwenR.png"
      }
    }
  },
  {
    "name": "Hecarim",
    "class": "the Shadow of War",
    "id": "Hecarim",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Hecarim.png",
    "abilities": {
      "Q": {
        "name": "Rampage",
        "description": "Hecarim cleaves nearby enemies dealing physical damage. If Hecarim damages at least one enemy, he increases the damage and lowers the cooldown of subsequent Rampages.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HecarimRapidSlash.png"
      },
      "W": {
        "name": "Spirit of Dread",
        "description": "Hecarim gains Armor and Magic Resist. Hecarim deals magic damage to nearby enemies, and gains Health equal to a percentage of any damage those enemies suffer.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HecarimW.png"
      },
      "E": {
        "name": "Devastating Charge",
        "description": "Hecarim gains increasing Move Speed and can move through units for a short duration. His next attack knocks the target back and deals additional physical damage based on the distance he has traveled since activating the ability.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HecarimRamp.png"
      },
      "R": {
        "name": "Onslaught of Shadows",
        "description": "Hecarim summons spectral riders and charges forward, dealing magic damage in a line. Hecarim creates a shockwave when he finishes his charge, causing nearby enemies to flee in terror.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HecarimUlt.png"
      }
    }
  },
  {
    "name": "Heimerdinger",
    "class": "the Revered Inventor",
    "id": "Heimerdinger",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Heimerdinger.png",
    "abilities": {
      "Q": {
        "name": "H-28 G Evolution Turret",
        "description": "Heimerdinger lays down a rapid-fire cannon turret equipped with a secondary pass-through beam attack (turrets deal half damage to towers).",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HeimerdingerQ.png"
      },
      "W": {
        "name": "Hextech Micro-Rockets",
        "description": "Heimerdinger fires long-range rockets that converge on his cursor.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HeimerdingerW.png"
      },
      "E": {
        "name": "CH-2 Electron Storm Grenade",
        "description": "Heimerdinger lobs a grenade at a location, dealing damage to enemy units, as well as stunning anyone directly hit and slowing surrounding units.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HeimerdingerE.png"
      },
      "R": {
        "name": "UPGRADE!!!",
        "description": "Heimerdinger invents an upgrade, causing his next spell to have increased effects. ",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HeimerdingerR.png"
      }
    }
  },
  {
    "name": "Hwei",
    "class": "the Visionary",
    "id": "Hwei",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Hwei.png",
    "abilities": {
      "Q": {
        "name": "Subject: Disaster",
        "description": "Hwei envisions a series of disasters, allowing him to paint a devastating blow.<br><br>This ability replaces Hwei's abilities with damaging abilities: Devastating Fire, Severing Bolt, and Molten Fissure.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HweiQ.png"
      },
      "W": {
        "name": "Subject: Serenity",
        "description": "Hwei envisions a series of serenities, allowing him to paint invigorating settings.<br><br>This ability replaces Hwei's abilities with utility abilities: Fleeting Current, Pool of Reflection, and Stirring Lights.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HweiW.png"
      },
      "E": {
        "name": "Subject: Torment",
        "description": "Hwei envisions a series of torments, allowing him to paint controlling visages.<br><br>This ability replaces Hwei's abilities with crowd control abilities: Grim Visage, Gaze of the Abyss, and Crushing Maw.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HweiE.png"
      },
      "R": {
        "name": "Spiraling Despair",
        "description": "Hwei paints a vision of pure despair. The first enemy champion struck becomes the center of an expanding painting that slows and damages nearby enemies. The vision explodes after reaching its maximum size or when the champion dies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HweiR.png"
      }
    }
  },
  {
    "name": "Illaoi",
    "class": "the Kraken Priestess",
    "id": "Illaoi",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Illaoi.png",
    "abilities": {
      "Q": {
        "name": "Tentacle Smash",
        "description": "Increases the damage dealt by Tentacles. When activated, Illaoi smashes down a Tentacle that deals physical damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IllaoiQ.png"
      },
      "W": {
        "name": "Harsh Lesson",
        "description": "Illaoi leaps to her target, dealing physical damage and causing nearby Tentacles to also swing at the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IllaoiW.png"
      },
      "E": {
        "name": "Test of Spirit",
        "description": "Illaoi rips the spirit from a foe's body, forcing it to stand before her. Spirits echo a percentage of the damage they take to the original target. If killed, or if the target gets too far from the spirit, the target will become a <font color='#669900'>Vessel</font> and begin spawning Tentacles.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IllaoiE.png"
      },
      "R": {
        "name": "Leap of Faith",
        "description": "Illaoi smashes her idol into the ground, dealing physical damage to nearby enemies. A Tentacle spawns for each enemy champion hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IllaoiR.png"
      }
    }
  },
  {
    "name": "Irelia",
    "class": "the Blade Dancer",
    "id": "Irelia",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Irelia.png",
    "abilities": {
      "Q": {
        "name": "Bladesurge",
        "description": "Irelia dashes forward to strike her target, healing herself. If the target is Marked or dies to Bladesurge, its cooldown refreshes.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IreliaQ.png"
      },
      "W": {
        "name": "Defiant Dance",
        "description": "Irelia charges a strike that deals more damage as she charges. She takes reduced physical damage during the charge.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IreliaW.png"
      },
      "E": {
        "name": "Flawless Duet",
        "description": "Irelia sends out two blades which converge on each other. Enemies caught in between are damaged, stunned and Marked.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IreliaE.png"
      },
      "R": {
        "name": "Vanguard's Edge",
        "description": "Irelia fires a massive number of blades that explode outward upon hitting an enemy champion. Enemies hit by the blades are damaged and Marked. Afterwards the blades form a wall that will damage and slow enemies that walk through it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IreliaR.png"
      }
    }
  },
  {
    "name": "Ivern",
    "class": "the Green Father",
    "id": "Ivern",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Ivern.png",
    "abilities": {
      "Q": {
        "name": "Rootcaller",
        "description": "Ivern conjures a vine, dealing damage and rooting enemy targets hit. Ivern's allies can dash to the rooted target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IvernQ.png"
      },
      "W": {
        "name": "Brushmaker",
        "description": "In brush, Ivern and his nearby allies attacks deal bonus magic damage. Ivern can activate this ability to create a patch of brush.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IvernW.png"
      },
      "E": {
        "name": "Triggerseed",
        "description": "Ivern places a shield on an ally which explodes after a short duration slowing and damaging enemies. The shield refreshes if it hits no enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IvernE.png"
      },
      "R": {
        "name": "Daisy!",
        "description": "Ivern summons his Sentinel friend Daisy to fight with him. Re-cast command Daisy to attack or move.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/IvernR.png"
      }
    }
  },
  {
    "name": "Janna",
    "class": "the Storm's Fury",
    "id": "Janna",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Janna.png",
    "abilities": {
      "Q": {
        "name": "Howling Gale",
        "description": "By creating a localized change in pressure and temperature, Janna is able to create a small storm that grows in size with time. She can activate the spell again to release the storm. On release this storm will fly towards the direction it was cast in, dealing damage and knocking away any enemies in its path.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HowlingGale.png"
      },
      "W": {
        "name": "Zephyr",
        "description": "Janna summons an air elemental that passively increases her Move Speed and enables her to pass through units. She may also activate this ability to deal damage and slow an enemy's Move Speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SowTheWind.png"
      },
      "E": {
        "name": "Eye Of The Storm",
        "description": "Janna conjures a defensive gale that shields an ally champion or turret from incoming damage and increases their Attack Damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/EyeOfTheStorm.png"
      },
      "R": {
        "name": "Monsoon",
        "description": "Janna surrounds herself in a magical storm, throwing enemies back. After the storm has settled, soothing winds heal nearby allies while the ability is active.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ReapTheWhirlwind.png"
      }
    }
  },
  {
    "name": "Jarvan IV",
    "class": "the Exemplar of Demacia",
    "id": "JarvanIV",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/JarvanIV.png",
    "abilities": {
      "Q": {
        "name": "Dragon Strike",
        "description": "Jarvan IV extends his lance, dealing physical damage and lowering the Armor of enemies in its path. Additionally, this will pull Jarvan to his Demacian Standard, knocking up enemies in his path.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JarvanIVDragonStrike.png"
      },
      "W": {
        "name": "Golden Aegis",
        "description": "Jarvan IV calls upon the ancient kings of Demacia to shield him from harm and slow surrounding enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JarvanIVGoldenAegis.png"
      },
      "E": {
        "name": "Demacian Standard",
        "description": "Jarvan IV carries the pride of Demacia, passively granting him bonus Attack Speed. Activating Demacian Standard allows Jarvan IV to place a Demacian flag that deals magic damage on impact and grants Attack Speed to nearby allied champions.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JarvanIVDemacianStandard.png"
      },
      "R": {
        "name": "Cataclysm",
        "description": "Jarvan IV heroically leaps into battle at a target with such force that he terraforms the surrounding area to create an arena around them. Nearby enemies are damaged at the moment of impact.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JarvanIVCataclysm.png"
      }
    }
  },
  {
    "name": "Jax",
    "class": "Grandmaster at Arms",
    "id": "Jax",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Jax.png",
    "abilities": {
      "Q": {
        "name": "Leap Strike",
        "description": "Jax leaps toward a unit. If they are an enemy, he strikes them with his weapon.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JaxQ.png"
      },
      "W": {
        "name": "Empower",
        "description": "Jax charges his weapon with energy, causing his next attack to deal additional damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JaxW.png"
      },
      "E": {
        "name": "Counter Strike",
        "description": "Jax's combat prowess allows him to dodge all incoming attacks for a short duration and then quickly counterattack, stunning all surrounding enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JaxE.png"
      },
      "R": {
        "name": "Grandmaster-at-Arms",
        "description": "Every third consecutive attack deals additional Magic Damage. Additionally, Jax can activate this ability to deal damage around himself and strengthen his resolve, increasing his Armor and Magic Resist for a short duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JaxR.png"
      }
    }
  },
  {
    "name": "Jayce",
    "class": "the Defender of Tomorrow",
    "id": "Jayce",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Jayce.png",
    "abilities": {
      "Q": {
        "name": "To the Skies! / Shock Blast",
        "description": "Hammer Stance: Leaps to an enemy dealing physical damage and slowing enemies.<br><br>Cannon Stance: Fires an orb of electricity that detonates upon hitting an enemy (or reaching the end of its path) dealing physical damage to all enemies hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JayceToTheSkies.png"
      },
      "W": {
        "name": "Lightning Field / Hyper Charge",
        "description": "Hammer Stance: Passive: Restores Mana per strike. Active: Creates a field of lightning damaging nearby enemies for several seconds.<br><br>Cannon Stance: Gains a burst of energy, increasing Attack Speed to maximum for several attacks.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JayceStaticField.png"
      },
      "E": {
        "name": "Thundering Blow / Acceleration Gate",
        "description": "Hammer Stance: Deals magic damage to an enemy and knocks them back a short distance.<br><br>Cannon Stance: Deploys an Acceleration Gate increasing the Move Speed of all allied champions who pass through it. If Shock Blast is fired through the gate the missile speed, range, and damage will increase.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JayceThunderingBlow.png"
      },
      "R": {
        "name": "Mercury Cannon / Mercury Hammer",
        "description": "Hammer Stance: Transforms the Mercury Hammer into the Mercury Cannon gaining new abilities and increased range. The first attack in this form reduces the target's Armor and Magic Resist.<br><br>Cannon Stance: Transforms the Mercury Cannon into the Mercury Hammer gaining new abilities and increasing Armor and Magic Resist. The first attack in this form deals additional magic damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JayceStanceHtG.png"
      }
    }
  },
  {
    "name": "Jhin",
    "class": "the Virtuoso",
    "id": "Jhin",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Jhin.png",
    "abilities": {
      "Q": {
        "name": "Dancing Grenade",
        "description": "Jhin launches a magical cartridge at an enemy. It can hit up to four targets and gains damage each time it kills.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JhinQ.png"
      },
      "W": {
        "name": "Deadly Flourish",
        "description": "Jhin brandishes his cane, firing a single shot with incredible range. It pierces through minions and monsters, but stops on the first champion hit. If the target was recently struck by Jhin's allies, lotus traps, or damaged by Jhin, they are rooted.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JhinW.png"
      },
      "E": {
        "name": "Captive Audience",
        "description": "Jhin places an invisible lotus trap that blooms when walked over. It slows nearby enemies before dealing damage with an explosion of serrated petals. <br><br><font color='#FFFFFF'>Beauty in Death -</font> When Jhin kills an enemy champion, a lotus trap will bloom near their corpse.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JhinE.png"
      },
      "R": {
        "name": "Curtain Call",
        "description": "Jhin channels, transforming Whisper into a shoulder-mounted mega-cannon. It is able to fire 4 super shots at extreme range that pierce through minions and monsters, but stop on the first champion impacted. Whisper cripples enemies hit, which slows them and deals execute damage. The 4th shot is perfectly crafted, epically powerful, and guaranteed to critically strike.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JhinR.png"
      }
    }
  },
  {
    "name": "Jinx",
    "class": "the Loose Cannon",
    "id": "Jinx",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Jinx.png",
    "abilities": {
      "Q": {
        "name": "Switcheroo!",
        "description": "Jinx modifies her basic attacks by swapping between Pow-Pow, her minigun and Fishbones, her rocket launcher. Attacks with Pow-Pow grant Attack Speed, while attacks with Fishbones deal area of effect damage, gain increased range, but drain Mana and attack slower.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JinxQ.png"
      },
      "W": {
        "name": "Zap!",
        "description": "Jinx uses Zapper, her shock pistol, to fire a blast that deals damage to the first enemy hit, slowing and revealing it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JinxW.png"
      },
      "E": {
        "name": "Flame Chompers!",
        "description": "Jinx throws out a line of snare grenades that explode after 5 seconds, lighting enemies on fire. Flame Chompers will bite enemy champions who walk over them, rooting them in place.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JinxE.png"
      },
      "R": {
        "name": "Super Mega Death Rocket!",
        "description": "Jinx fires a super rocket across the map that gains damage as it travels. The rocket will explode upon colliding with an enemy champion, dealing damage to it and surrounding enemies based on their missing Health.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JinxR.png"
      }
    }
  },
  {
    "name": "Kai'Sa",
    "class": "Daughter of the Void",
    "id": "Kaisa",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Kaisa.png",
    "abilities": {
      "Q": {
        "name": "Icathian Rain",
        "description": "Kai'Sa shoots a swarm of missiles that seek out nearby targets.<br><br>Living Weapon: Icathian Rain is upgraded to shoot more missiles.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KaisaQ.png"
      },
      "W": {
        "name": "Void Seeker",
        "description": "Kai'Sa shoots a long range missile, marking enemies with her passive.<br><br>Living Weapon: Void Seeker is upgraded to apply more passive marks and reduce cooldown on champion hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KaisaW.png"
      },
      "E": {
        "name": "Supercharge",
        "description": "Kai'Sa briefly increases her Move Speed, then increases her Attack Speed.<br><br>Living Weapon: Supercharge is upgraded to briefly grant Invisibility.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KaisaE.png"
      },
      "R": {
        "name": "Killer Instinct",
        "description": "Kai'Sa dashes near an enemy champion.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KaisaR.png"
      }
    }
  },
  {
    "name": "Kalista",
    "class": "the Spear of Vengeance",
    "id": "Kalista",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Kalista.png",
    "abilities": {
      "Q": {
        "name": "Pierce",
        "description": "Throw a fast moving spear that passes through enemies it kills.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KalistaMysticShot.png"
      },
      "W": {
        "name": "Sentinel",
        "description": "Gain bonus damage when Kalista and her Oathsworn strike the same target. <br><br>Activate to send a soul to scout out the path, revealing the area in front of it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KalistaW.png"
      },
      "E": {
        "name": "Rend",
        "description": "Attacks impale their targets with spears. Activate to rip the spears out, slowing and dealing escalating damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KalistaExpungeWrapper.png"
      },
      "R": {
        "name": "Fate's Call",
        "description": "Kalista teleports the Oathsworn ally to herself. They gain the ability to dash toward a position, knocking enemy champions back.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KalistaRx.png"
      }
    }
  },
  {
    "name": "Karma",
    "class": "the Enlightened One",
    "id": "Karma",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Karma.png",
    "abilities": {
      "Q": {
        "name": "Inner Flame",
        "description": "Karma sends forth a ball of spirit energy that explodes and deals damage upon hitting an enemy unit.<br><br>Mantra Bonus: In addition to the explosion, Mantra increases the destructive power of her Inner Flame, creating a cataclysm which deals damage after a short delay.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KarmaQ.png"
      },
      "W": {
        "name": "Focused Resolve",
        "description": "Karma creates a tether between herself and a targeted enemy, dealing damage and revealing them. If the tether is not broken, the enemy will be rooted and damaged again.<br><br>Mantra Bonus: Karma strengthens the link, healing herself and extending the root duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KarmaSpiritBind.png"
      },
      "E": {
        "name": "Inspire",
        "description": "Karma summons a protective shield that absorbs incoming damage and increases the Move Speed of the protected ally.<br><br>Mantra Bonus: Energy radiates out from her target, strengthening the initial shield and applying Inspire to nearby allied champions.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KarmaSolKimShield.png"
      },
      "R": {
        "name": "Mantra",
        "description": "Karma empowers her next ability to do an additional effect. Mantra is available at level 1 and does not require a skill point.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KarmaMantra.png"
      }
    }
  },
  {
    "name": "Karthus",
    "class": "the Deathsinger",
    "id": "Karthus",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Karthus.png",
    "abilities": {
      "Q": {
        "name": "Lay Waste",
        "description": "Karthus unleashes a delayed blast at a location, dealing damage to nearby enemies. Deals increased damage to isolated enemies. ",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KarthusLayWasteA1.png"
      },
      "W": {
        "name": "Wall of Pain",
        "description": "Karthus creates a passable screen of leeching energy. Any enemy units that walk through the screen have their Move Speed and Magic Resist reduced for a period.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KarthusWallOfPain.png"
      },
      "E": {
        "name": "Defile",
        "description": "Karthus passively steals energy from his victims, gaining Mana on each kill. Alternatively, Karthus can surround himself in the souls of his prey, dealing damage to nearby enemies, but quickly draining his own Mana.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KarthusDefile.png"
      },
      "R": {
        "name": "Requiem",
        "description": "After channeling for 3 seconds, Karthus deals damage to all enemy champions.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KarthusFallenOne.png"
      }
    }
  },
  {
    "name": "Kassadin",
    "class": "the Void Walker",
    "id": "Kassadin",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Kassadin.png",
    "abilities": {
      "Q": {
        "name": "Null Sphere",
        "description": "Kassadin fires an orb of void energy at a target, dealing damage and interrupting channels. The excess energy forms around himself, granting a temporary shield that absorbs magic damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NullLance.png"
      },
      "W": {
        "name": "Nether Blade",
        "description": "Passive: Kassadin's basic attacks deal bonus magic damage. Active: Kassadin's next basic attack deals significant bonus magic damage and restores Mana.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NetherBlade.png"
      },
      "E": {
        "name": "Force Pulse",
        "description": "Kassadin draws energy from spells cast in his vicinity. Upon charging up, Kassadin can use Force Pulse to damage and slow enemies in a cone in front of him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ForcePulse.png"
      },
      "R": {
        "name": "Riftwalk",
        "description": "Kassadin teleports to a nearby location dealing damage to nearby enemy units. Multiple Riftwalks in a short period of time cost additional Mana but also deal additional damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RiftWalk.png"
      }
    }
  },
  {
    "name": "Katarina",
    "class": "the Sinister Blade",
    "id": "Katarina",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Katarina.png",
    "abilities": {
      "Q": {
        "name": "Bouncing Blade",
        "description": "Katarina throws a <font color='#FFF673'>Dagger</font> at the target that then bounces to nearby enemies before ricocheting onto the ground.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KatarinaQ.png"
      },
      "W": {
        "name": "Preparation",
        "description": "Katarina gains a burst of Move Speed, tossing a <font color='#FFF673'>Dagger</font> into the air directly above herself.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KatarinaW.png"
      },
      "E": {
        "name": "Shunpo",
        "description": "Katarina blinks to the target, striking it if its an enemy, or striking the nearest enemy otherwise.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KatarinaEWrapper.png"
      },
      "R": {
        "name": "Death Lotus",
        "description": "Katarina becomes a flurry of blades, dealing massive magic damage while she channels to the 3 nearest enemy champions.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KatarinaR.png"
      }
    }
  },
  {
    "name": "Kayle",
    "class": "the Righteous",
    "id": "Kayle",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Kayle.png",
    "abilities": {
      "Q": {
        "name": "Radiant Blast",
        "description": "Kayle conjures a portal, summoning a celestial sword that pierces through enemies, slowing, damaging, and reducing the resistances of all hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KayleQ.png"
      },
      "W": {
        "name": "Celestial Blessing",
        "description": "Blessed by the divine, Kayle heals and grants Move Speed to herself and the nearest ally.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KayleW.png"
      },
      "E": {
        "name": "Starfire Spellblade",
        "description": "Passive: Kayle's celestial sword, Virtue, deals bonus magic damage to enemies she attacks.<br><br>Active: Kayle's next attack smites her target with celestial fire, dealing bonus damage proportionate to their missing health.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KayleE.png"
      },
      "R": {
        "name": "Divine Judgment",
        "description": "Kayle makes an ally invulnerable and calls upon former Aspects of Justice to purify the area around her target with a holy rain of swords.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KayleR.png"
      }
    }
  },
  {
    "name": "Kayn",
    "class": "the Shadow Reaper",
    "id": "Kayn",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Kayn.png",
    "abilities": {
      "Q": {
        "name": "Reaping Slash",
        "description": "Kayn dashes, then slashes. Both deal damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KaynQ.png"
      },
      "W": {
        "name": "Blade's Reach",
        "description": "Kayn damages and slows targets in a line.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KaynW.png"
      },
      "E": {
        "name": "Shadow Step",
        "description": "Kayn can walk through terrain.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KaynE.png"
      },
      "R": {
        "name": "Umbral Trespass",
        "description": "Kayn hides in an enemy's body, dealing massive damage when he bursts out.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KaynR.png"
      }
    }
  },
  {
    "name": "Kennen",
    "class": "the Heart of the Tempest",
    "id": "Kennen",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Kennen.png",
    "abilities": {
      "Q": {
        "name": "Thundering Shuriken",
        "description": "Kennen throws a fast moving shuriken towards a location, causing damage and adding a Mark of the Storm to any opponent that it hits.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KennenShurikenHurlMissile1.png"
      },
      "W": {
        "name": "Electrical Surge",
        "description": "Kennen passively deals extra damage and adds a Mark of the Storm to his target every few attacks, and he can activate this ability to damage and add another Mark of the Storm to targets who are already marked.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KennenBringTheLight.png"
      },
      "E": {
        "name": "Lightning Rush",
        "description": "Kennen morphs into a lightning form, enabling him to pass through units and apply a Mark of the Storm. Kennen gains Move Speed when entering this form, and attack speed when leaving it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KennenLightningRush.png"
      },
      "R": {
        "name": "Slicing Maelstrom",
        "description": "Kennen summons a storm that strikes at nearby enemy champions for magical damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KennenShurikenStorm.png"
      }
    }
  },
  {
    "name": "Kha'Zix",
    "class": "the Voidreaver",
    "id": "Khazix",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Khazix.png",
    "abilities": {
      "Q": {
        "name": "Taste Their Fear",
        "description": "Deals physical damage to the target. Damage increased on <font color='#FFF673'>Isolated</font> targets. If he chooses to <font color='#00DD33'>Evolve Reaper Claws</font>, this refunds a percent of it's cooldown against <font color='#FFF673'>Isolated</font> targets. Kha'Zix also gains increased range on his basic attacks and Taste Their Fear.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KhazixQ.png"
      },
      "W": {
        "name": "Void Spike",
        "description": "Kha'Zix fires exploding spikes that deal physical damage to enemies hit. Kha'Zix is healed if he is also within the explosion radius. If he chooses to <font color='#00DD33'>Evolve Spike Racks</font>, Void Spike now fires three spikes in a cone, slow enemies hit, and reveals enemy champions hit for 2 seconds. <font color='#FFF673'>Isolated</font> targets are slowed for extra.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KhazixW.png"
      },
      "E": {
        "name": "Leap",
        "description": "Kha'Zix leaps to an area, dealing physical damage upon landing. If he chooses to <font color='#00DD33'>Evolve Wings</font>, Leap's range increases by 200 and the cooldown resets on champion kill or assist.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KhazixE.png"
      },
      "R": {
        "name": "Void Assault",
        "description": "Each rank allows Kha'Zix to evolve one of his abilities, giving it a unique additional effect. When activated, Kha'Zix becomes <font color='#91d7ee'>Invisible</font>, triggering Unseen Threat and increasing Move Speed. If he chooses to <font color='#00DD33'>Evolve Adaptive Cloaking</font>, Void Assault gains increased <font color='#91d7ee'>Invisibility</font> duration, and an additional use.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KhazixR.png"
      }
    }
  },
  {
    "name": "Kindred",
    "class": "The Eternal Hunters",
    "id": "Kindred",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Kindred.png",
    "abilities": {
      "Q": {
        "name": "Dance of Arrows",
        "description": "Kindred tumbles and shoots up to three arrows at nearby targets.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KindredQ.png"
      },
      "W": {
        "name": "Wolf's Frenzy",
        "description": "Wolf enrages and attacks enemies around him.  Lamb passively gains stacks by moving and attacking. When fully charged, Lamb's next attack restores health.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KindredW.png"
      },
      "E": {
        "name": "Mounting Dread",
        "description": "Lamb fires a carefully placed shot, slowing the target. If Lamb attacks the target two more times, her third attack instead directs Wolf to pounce on the enemy, savaging them for massive damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KindredEWrapper.png"
      },
      "R": {
        "name": "Lamb's Respite",
        "description": "Lamb grants all living things inside a zone a respite from death. Until the effect ends, nothing can die. At the end, units are healed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KindredR.png"
      }
    }
  },
  {
    "name": "Kled",
    "class": "the Cantankerous Cavalier",
    "id": "Kled",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Kled.png",
    "abilities": {
      "Q": {
        "name": "Bear Trap on a Rope",
        "description": "Kled throws a bear trap that damages and hooks an enemy champion. If shackled for a short duration, the target takes additional physical damage and is yanked toward Kled.<br><br>When dismounted, this ability is replaced by Pocket Pistol, a ranged gun blast that knocks back Kled and restores courage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KledQ.png"
      },
      "W": {
        "name": "Violent Tendencies",
        "description": "Kled gains massive attack speed for four attacks. The fourth attack deals more damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KledW.png"
      },
      "E": {
        "name": "Jousting",
        "description": "Kled dashes, dealing physical damage and gaining a short burst of speed. Kled can cast this ability again to dash back through his initial target, dealing the same damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KledE.png"
      },
      "R": {
        "name": "Chaaaaaaaarge!!!",
        "description": "Kled and Skaarl charge to a location, leaving a speed-granting trail behind them and gaining a shield. Skaarl locks onto and rams the first enemy champion encountered.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KledR.png"
      }
    }
  },
  {
    "name": "Kog'Maw",
    "class": "the Mouth of the Abyss",
    "id": "KogMaw",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/KogMaw.png",
    "abilities": {
      "Q": {
        "name": "Caustic Spittle",
        "description": "Kog'Maw launches a corrosive projectile which deals magic damage and corrodes the target's armor and magic resist for a short time. Kog'Maw also gains additional attack speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KogMawQ.png"
      },
      "W": {
        "name": "Bio-Arcane Barrage",
        "description": "Kog'Maw's attacks gain range and deal a percent of the target's maximum health as magic damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KogMawBioArcaneBarrage.png"
      },
      "E": {
        "name": "Void Ooze",
        "description": "Kog'Maw launches a peculiar ooze which damages all enemies it passes through and leaves a trail which slows enemies who stand on it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KogMawVoidOoze.png"
      },
      "R": {
        "name": "Living Artillery",
        "description": "Kog'Maw fires an artillery shell at a great distance dealing magic damage (increased significantly on low health enemies) and revealing non-stealthed targets. Additionally, multiple Living Artilleries in a short period of time cause them to cost additional Mana.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KogMawLivingArtillery.png"
      }
    }
  },
  {
    "name": "K'Sante",
    "class": "the Pride of Nazumah",
    "id": "KSante",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/KSante.png",
    "abilities": {
      "Q": {
        "name": "Ntofo Strikes",
        "description": "K'Sante strikes, damaging and slowing enemies in a short line.<br><br>On hit, grants a stack of Ntofo Strikes. At 2 stacks, K'Sante fires a shockwave that pulls enemies in.<br><br>When All Out, cooldown is reduced.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KSanteQ.png"
      },
      "W": {
        "name": "Path Maker",
        "description": "K'Sante charges up, taking reduced damage, then dashes, knocking back and stunning enemies.<br><br>When All Out, deals increased damage and no longer knocks back or stuns.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KSanteW.png"
      },
      "E": {
        "name": "Footwork",
        "description": "K'Sante dashes and gains a shield. If targeting an ally, K'Sante dashes to the ally with increased range and both gain a shield.<br><br>When All Out, cooldown is reduced and speed is increased.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KSanteE.png"
      },
      "R": {
        "name": "All Out",
        "description": "K'Sante knocks an enemy back, launching them through any wall in their path. Then, K'Sante goes All Out and dashes after them, gaining increased damage, healing, and transformed abilities at the cost of reduced defenses.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/KSanteR.png"
      }
    }
  },
  {
    "name": "LeBlanc",
    "class": "the Deceiver",
    "id": "Leblanc",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Leblanc.png",
    "abilities": {
      "Q": {
        "name": "Sigil of Malice",
        "description": "LeBlanc projects a sigil, dealing damage and marking the target for 3.5 seconds. Damaging the marked target with an ability detonates the sigil, dealing additional damage. If either part kills the target, Leblanc refunds the Mana cost and part of this spell's remaining Cooldown.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeblancQ.png"
      },
      "W": {
        "name": "Distortion",
        "description": "LeBlanc dashes to a location, dealing damage to enemies near her destination. For the next 4 seconds, activate Distortion again to return LeBlanc to her starting location.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeblancW.png"
      },
      "E": {
        "name": "Ethereal Chains",
        "description": "LeBlanc launches a chain that shackles the first enemy hit. If the target remains shackled for 1.5 seconds, LeBlanc roots them and deals additional damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeblancE.png"
      },
      "R": {
        "name": "Mimic",
        "description": "LeBlanc casts a mimicked version of one of her basic spells.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeblancR.png"
      }
    }
  },
  {
    "name": "Lee Sin",
    "class": "the Blind Monk",
    "id": "LeeSin",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/LeeSin.png",
    "abilities": {
      "Q": {
        "name": "Sonic Wave / Resonating Strike",
        "description": "Sonic Wave: Lee Sin projects a discordant wave of sound to locate his enemies, dealing physical damage to the first enemy it encounters. If Sonic Wave hits, Lee Sin can cast Resonating Strike for the next 3 seconds.<br>Resonating Strike: Lee Sin dashes to the enemy hit by Sonic Wave, dealing physical damage based on the target's missing Health.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeeSinQOne.png"
      },
      "W": {
        "name": "Safeguard / Iron Will",
        "description": "Safeguard: Lee Sin rushes to target ally, shielding himself from damage. If the ally is a champion, they are also shielded. After using Safeguard, Lee Sin can cast Iron Will.<br>Iron Will: Lee Sin's intense training allows him to thrive in battle. Lee Sin gains Omnivamp.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeeSinWOne.png"
      },
      "E": {
        "name": "Tempest / Cripple",
        "description": "Tempest: Lee Sin smashes the ground, sending out a shockwave that deals magic damage and reveals enemy units hit. If Tempest hits an enemy, Lee Sin can cast cripple.<br>Cripple: Lee Sin cripples nearby enemies damaged by Tempest, reducing their Move Speed. Move Speed recovers gradually over the duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeeSinEOne.png"
      },
      "R": {
        "name": "Dragon's Rage",
        "description": "Lee Sin performs a powerful roundhouse kick launching his target back, dealing physical damage to the target and any enemies they collide with. Enemies the target collides with are knocked into the air for a short duration. This technique was taught to him by Jesse Perring, although Lee Sin does not kick players off the map.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeeSinR.png"
      }
    }
  },
  {
    "name": "Leona",
    "class": "the Radiant Dawn",
    "id": "Leona",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Leona.png",
    "abilities": {
      "Q": {
        "name": "Shield of Daybreak",
        "description": "Leona uses her shield to perform her next basic attack, dealing bonus magic damage and stunning the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeonaShieldOfDaybreak.png"
      },
      "W": {
        "name": "Eclipse",
        "description": "Leona raises her shield to gain Damage Reduction, Armor, and Magic Resist. When the duration first ends, if there are nearby enemies, she will deal magic damage to them and prolong the duration of the effect.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeonaSolarBarrier.png"
      },
      "E": {
        "name": "Zenith Blade",
        "description": "Leona projects a solar image of her sword, dealing magic damage to all enemies in a line. When the image fades, the last enemy champion struck will be briefly immobilized and Leona will dash to them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeonaZenithBlade.png"
      },
      "R": {
        "name": "Solar Flare",
        "description": "Leona calls down a beam of solar energy, dealing damage to enemies in an area. Enemies in the center of the area are stunned, while enemies on the outside are slowed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LeonaSolarFlare.png"
      }
    }
  },
  {
    "name": "Lillia",
    "class": "the Bashful Bloom",
    "id": "Lillia",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Lillia.png",
    "abilities": {
      "Q": {
        "name": "Blooming Blows",
        "description": "Passively, Lillia gains stacking Move Speed when hitting enemies with spells. She can activate this to deal magic damage to nearby enemies, dealing extra true damage on the edge.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LilliaQ.png"
      },
      "W": {
        "name": "Watch Out! Eep!",
        "description": "Lillia deals damage in a nearby area, dealing heavy damage in the center.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LilliaW.png"
      },
      "E": {
        "name": "Swirlseed",
        "description": "Lillia hurls a seed that damages and slows those it lands on. If it doesn't hit anything, it will continue rolling until it hits a wall or target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LilliaE.png"
      },
      "R": {
        "name": "Lilting Lullaby",
        "description": "Lillia causes all enemies with Dream Dust on them to become Drowsy before falling asleep. Those enemies will take extra damage on being forcibly woken up.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LilliaR.png"
      }
    }
  },
  {
    "name": "Lissandra",
    "class": "the Ice Witch",
    "id": "Lissandra",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Lissandra.png",
    "abilities": {
      "Q": {
        "name": "Ice Shard",
        "description": "Throws a spear of ice that shatters when it hits an enemy, dealing magic damage and slowing Move Speed. Shards pass through the target, dealing the same damage to other enemies hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LissandraQ.png"
      },
      "W": {
        "name": "Ring of Frost",
        "description": "Freezes nearby enemies in ice, dealing magic damage and rooting them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LissandraW.png"
      },
      "E": {
        "name": "Glacial Path",
        "description": "Lissandra creates an ice claw that deals magic damage. Reactivating this ability transports Lissandra to the claw's current location.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LissandraE.png"
      },
      "R": {
        "name": "Frozen Tomb",
        "description": "If cast on an enemy champion, the target is frozen solid, stunning it. If cast on Lissandra, she encases herself in dark ice, healing herself while becoming untargetable and invulnerable. Dark ice then emanates from the target dealing magic damage to enemies and slowing Move Speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LissandraR.png"
      }
    }
  },
  {
    "name": "Lucian",
    "class": "the Purifier",
    "id": "Lucian",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Lucian.png",
    "abilities": {
      "Q": {
        "name": "Piercing Light",
        "description": "Lucian shoots a bolt of piercing light through a target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LucianQ.png"
      },
      "W": {
        "name": "Ardent Blaze",
        "description": "Lucian shoots a missile that explodes in a star shape, marking and briefly revealing enemies. Lucian gains Move Speed for attacking marked enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LucianW.png"
      },
      "E": {
        "name": "Relentless Pursuit",
        "description": "Lucian quickly dashes a short distance. Lightslinger attacks reduce Relentless Pursuit's cooldown.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LucianE.png"
      },
      "R": {
        "name": "The Culling",
        "description": "Lucian unleashes a torrent of shots from his weapons.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LucianR.png"
      }
    }
  },
  {
    "name": "Lulu",
    "class": "the Fae Sorceress",
    "id": "Lulu",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Lulu.png",
    "abilities": {
      "Q": {
        "name": "Glitterlance",
        "description": "Pix and Lulu each fire a bolt of magical energy that damages and heavily slows all enemies it hits.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LuluQ.png"
      },
      "W": {
        "name": "Whimsy",
        "description": "If cast on an ally, grants them Attack Speed and Move Speed for a short time. If cast on an enemy, turns them into an adorable critter that can't attack or cast spells.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LuluW.png"
      },
      "E": {
        "name": "Help, Pix!",
        "description": "If cast on an ally, commands Pix to jump to an ally and shield them. He then follows them and aids their attacks. If cast on an enemy, commands Pix to jump to an enemy and damage them. He then follows them and grants you vision of that enemy.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LuluE.png"
      },
      "R": {
        "name": "Wild Growth",
        "description": "Lulu enlarges an ally, knocking nearby enemies into the air and granting the ally a large amount of bonus health. For the next few seconds, that ally gains an aura that slows nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LuluR.png"
      }
    }
  },
  {
    "name": "Lux",
    "class": "the Lady of Luminosity",
    "id": "Lux",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Lux.png",
    "abilities": {
      "Q": {
        "name": "Light Binding",
        "description": "Lux releases a sphere of light that binds and deals damage to up to two enemy units.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LuxLightBinding.png"
      },
      "W": {
        "name": "Prismatic Barrier",
        "description": "Lux throws her wand and bends the light around any friendly target it touches, protecting them from enemy damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LuxPrismaticWave.png"
      },
      "E": {
        "name": "Lucent Singularity",
        "description": "Fires an anomaly of twisted light to an area, which slows nearby enemies. Lux can detonate it to damage enemies in the area of effect.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LuxLightStrikeKugel.png"
      },
      "R": {
        "name": "Final Spark",
        "description": "After gathering energy, Lux fires a beam of light that deals damage to all targets in the area. In addition, triggers Lux's passive ability and refreshes the Illumination debuff duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/LuxR.png"
      }
    }
  },
  {
    "name": "Malphite",
    "class": "Shard of the Monolith",
    "id": "Malphite",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Malphite.png",
    "abilities": {
      "Q": {
        "name": "Seismic Shard",
        "description": "Malphite sends a shard of the earth through the ground at his foe, dealing damage upon impact and stealing Move Speed for 3 seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SeismicShard.png"
      },
      "W": {
        "name": "Thunderclap",
        "description": "Malphite attacks with such force that it creates a sonic boom. For the next few seconds, his attacks create aftershocks in front of him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Obduracy.png"
      },
      "E": {
        "name": "Ground Slam",
        "description": "Malphite slams the ground, sending out a shockwave that deals magic damage based on his Armor and reduces the Attack Speed of enemies for a short duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Landslide.png"
      },
      "R": {
        "name": "Unstoppable Force",
        "description": "Malphite launches himself to a location at high speed, damaging enemies and knocking them into the air.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/UFSlash.png"
      }
    }
  },
  {
    "name": "Malzahar",
    "class": "the Prophet of the Void",
    "id": "Malzahar",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Malzahar.png",
    "abilities": {
      "Q": {
        "name": "Call of the Void",
        "description": "Malzahar opens up two portals to the Void. After a short delay, they fire projectiles that deal Magic Damage and silence enemy champions.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MalzaharQ.png"
      },
      "W": {
        "name": "Void Swarm",
        "description": "Malzahar summons Voidlings to attack nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MalzaharW.png"
      },
      "E": {
        "name": "Malefic Visions",
        "description": "Malzahar infects his target's mind with cruel visions of their demise, dealing damage over time. Using Malzahar's other spells on the target will refresh the visions.<br><br>If the target dies while afflicted by the visions, they pass on to a nearby enemy unit and Malzahar gains Mana. Malzahar's Voidlings are attracted to affected units.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MalzaharE.png"
      },
      "R": {
        "name": "Nether Grasp",
        "description": "Malzahar channels the essence of the Void to suppress an enemy champion over a zone of damaging negative energy.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MalzaharR.png"
      }
    }
  },
  {
    "name": "Maokai",
    "class": "the Twisted Treant",
    "id": "Maokai",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Maokai.png",
    "abilities": {
      "Q": {
        "name": "Bramble Smash",
        "description": "Maokai knocks back nearby enemies with a shockwave, dealing magic damage and slowing them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MaokaiQ.png"
      },
      "W": {
        "name": "Twisted Advance",
        "description": "Maokai contorts into a mass of moving roots, becoming untargetable and dashing to the target. Upon arrival, he roots the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MaokaiW.png"
      },
      "E": {
        "name": "Sapling Toss",
        "description": "Maokai flings a sapling to the target area to stand guard. More effective in brush.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MaokaiE.png"
      },
      "R": {
        "name": "Nature's Grasp",
        "description": "Maokai summons a colossal wall of brambles and thorns that slowly advances forwards, damaging and rooting any enemies in the path.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MaokaiR.png"
      }
    }
  },
  {
    "name": "Master Yi",
    "class": "the Wuju Bladesman",
    "id": "MasterYi",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/MasterYi.png",
    "abilities": {
      "Q": {
        "name": "Alpha Strike",
        "description": "Master Yi teleports across the battlefield with blinding speed, dealing physical damage to multiple units in his path, while simultaneously becoming untargetable. Alpha Strike can critically strike and deals bonus physical damage to monsters. Basic attacks reduce Alpha Strike's cooldown.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AlphaStrike.png"
      },
      "W": {
        "name": "Meditate",
        "description": "Master Yi rejuvenates his body by focus of mind, restoring Health and taking reduced damage for a short time. In addition, Master Yi will gain stacks of Double Strike and pause the remaining duration on Wuju Style and Highlander for each second he channels.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Meditate.png"
      },
      "E": {
        "name": "Wuju Style",
        "description": "Grants bonus true damage on basic attacks.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/WujuStyle.png"
      },
      "R": {
        "name": "Highlander",
        "description": "Master Yi moves with unparalleled agility, temporarily increasing his Move Speed and Attack Speed as well as making him immune to all slowing effects. While active, Champion kills or assists extend Highlander's duration. Passively reduces cooldown for his other abilities on a kill or assist.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Highlander.png"
      }
    }
  },
  {
    "name": "Mel",
    "class": "the Soul's Reflection",
    "id": "Mel",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Mel.png",
    "abilities": {
      "Q": {
        "name": "Radiant Volley",
        "description": "Mel fires a barrage of projectiles that explode around a target location, dealing damage repeatedly to enemies within the area.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MelQ.png"
      },
      "W": {
        "name": "Rebuttal",
        "description": "Mel forms a barrier around herself that reflects enemy projectiles back at the attacker, prevents her from taking damage, and grants her movement speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MelW.png"
      },
      "E": {
        "name": "Solar Snare",
        "description": "Mel fires a radiant orb forward, rooting those at its center while the area around it slows enemies and deals damage over time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MelE.png"
      },
      "R": {
        "name": "Golden Eclipse",
        "description": "Mel strikes all enemies marked with Overwhelm regardless of their distance from her, dealing additional damage for each stack of Overwhelm.<br><br>Ranks of Golden Eclipse increase Overwhelm's damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MelR.png"
      }
    }
  },
  {
    "name": "Milio",
    "class": "The Gentle Flame",
    "id": "Milio",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Milio.png",
    "abilities": {
      "Q": {
        "name": "Ultra Mega Fire Kick",
        "description": "Kick a ball that knocks back an enemy. The ball launches upward on hit and falls toward the enemy, damaging and slowing enemies in the area upon impact.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MilioQ.png"
      },
      "W": {
        "name": "Cozy Campfire",
        "description": "Create an empowering zone that heals allies and increases attack range to those inside. The zone follows the ally nearest to the cast point.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MilioW.png"
      },
      "E": {
        "name": "Warm Hugs",
        "description": "Milio tosses a shield to an ally, temporarily increasing their movement speed. This ability has 2 charges.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MilioE.png"
      },
      "R": {
        "name": "Breath of Life",
        "description": "Milio unleashes a wave of soothing flames that heal and remove crowd control effects from allies in range.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MilioR.png"
      }
    }
  },
  {
    "name": "Miss Fortune",
    "class": "the Bounty Hunter",
    "id": "MissFortune",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/MissFortune.png",
    "abilities": {
      "Q": {
        "name": "Double Up",
        "description": "Miss Fortune fires a bullet at an enemy, damaging them and a target behind them. Both strikes can also apply Love Tap.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MissFortuneRicochetShot.png"
      },
      "W": {
        "name": "Strut",
        "description": "Miss Fortune passively gains Move Speed when not attacked. This ability can be activated to grant bonus Attack Speed for a short duration. While it's on cooldown, Love Taps reduce the remaining cooldown of Strut.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MissFortuneViciousStrikes.png"
      },
      "E": {
        "name": "Make It Rain",
        "description": "Miss Fortune reveals an area with a flurry of bullets, dealing waves of damage to opponents and slowing them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MissFortuneScattershot.png"
      },
      "R": {
        "name": "Bullet Time",
        "description": "Miss Fortune channels a barrage of bullets into a cone in front of her, dealing large amounts of damage to enemies. Each wave of Bullet Time can critically strike",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MissFortuneBulletTime.png"
      }
    }
  },
  {
    "name": "Wukong",
    "class": "the Monkey King",
    "id": "MonkeyKing",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/MonkeyKing.png",
    "abilities": {
      "Q": {
        "name": "Crushing Blow",
        "description": "Wukong's next attack gains attack range, deals bonus damage, and reduces the target's armor for a few seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MonkeyKingDoubleAttack.png"
      },
      "W": {
        "name": "Warrior Trickster",
        "description": "Wukong becomes <font color='#91d7ee'>Invisible</font> and dashes in a direction, leaving behind a clone that will attack nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MonkeyKingDecoy.png"
      },
      "E": {
        "name": "Nimbus Strike",
        "description": "Wukong dashes to a targeted enemy and sends out images to attack enemies near his target, dealing damage to each enemy struck.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MonkeyKingNimbus.png"
      },
      "R": {
        "name": "Cyclone",
        "description": "Wukong's extends his staff and spins it around repeatedly, gaining Move Speed.<br><br>Enemies struck take damage and are knocked up.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MonkeyKingSpinToWin.png"
      }
    }
  },
  {
    "name": "Mordekaiser",
    "class": "the Iron Revenant",
    "id": "Mordekaiser",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Mordekaiser.png",
    "abilities": {
      "Q": {
        "name": "Obliterate",
        "description": "Mordekaiser smashes the ground with his mace dealing damage to each enemy struck. Damage is increased when hitting a single enemy.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MordekaiserQ.png"
      },
      "W": {
        "name": "Indestructible",
        "description": "Mordekaiser stores damage he deals and takes to create a shield. He may consume the shield to heal.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MordekaiserW.png"
      },
      "E": {
        "name": "Death's Grasp",
        "description": "Mordekaiser pulls all enemies in an area.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MordekaiserE.png"
      },
      "R": {
        "name": "Realm of Death",
        "description": "Mordekaiser drags his victim to a different dimension with him and steals a portion of their stats. If he kills them, he keeps the stats until the victim respawns.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MordekaiserR.png"
      }
    }
  },
  {
    "name": "Morgana",
    "class": "the Fallen",
    "id": "Morgana",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Morgana.png",
    "abilities": {
      "Q": {
        "name": "Dark Binding",
        "description": "Morgana binds an enemy in place with dark magic, forcing them to feel the pain they've caused and dealing magic damage. ",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MorganaQ.png"
      },
      "W": {
        "name": "Tormented Shadow",
        "description": "Morgana casts a cursed shadow on an area, damaging enemies who dare stand in her dark circle. They receive magic damage over time, which increases the lower health they are.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MorganaW.png"
      },
      "E": {
        "name": "Black Shield",
        "description": "Morgana anoints an ally with a protective barrier of starfire, which absorbs magical damage and disabling effects until it is broken.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MorganaE.png"
      },
      "R": {
        "name": "Soul Shackles",
        "description": "Morgana unleashes the full force of her Celestial power as she unbinds her wings and hovers above the ground. She lashes chains of dark pain onto nearby enemy champions, gaining Move Speed. The chains slow and deal initial damage and, after a delay, stun those who are unable to break them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MorganaR.png"
      }
    }
  },
  {
    "name": "Naafiri",
    "class": "the Hound of a Hundred Bites",
    "id": "Naafiri",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Naafiri.png",
    "abilities": {
      "Q": {
        "name": "Darkin Daggers",
        "description": "Naafiri hurls up to two daggers, each inflicting bleed, or each inflicting bonus damage if the target is already bleeding.<br><br>Packmates leap to attack the first champion or monster hit by this skill.<br>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NaafiriQ.png"
      },
      "W": {
        "name": "The Call of the Pack",
        "description": "Naafiri becomes Untargetable and empowers her pack, spawning additional packmates and gaining increased Move Speed and Attack Damage.<br>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NaafiriR.png"
      },
      "E": {
        "name": "Eviscerate",
        "description": "Naafiri dashes and damages enemies in an area around her, recalling her packmates and fully healing them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NaafiriE.png"
      },
      "R": {
        "name": "Hounds' Pursuit",
        "description": "Naafiri and her packmates dash at a champion, dealing damage. Naafiri reveals nearby enemies if she scores a takedown and can recast this Ability once. The second cast grants a shield.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NaafiriW.png"
      }
    }
  },
  {
    "name": "Nami",
    "class": "the Tidecaller",
    "id": "Nami",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Nami.png",
    "abilities": {
      "Q": {
        "name": "Aqua Prison",
        "description": "Sends a bubble to a target area, dealing damage and stunning all enemies on impact.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NamiQ.png"
      },
      "W": {
        "name": "Ebb and Flow",
        "description": "Unleashes a stream of water that bounces back and forth between allied and enemy champions, healing allies and damaging enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NamiW.png"
      },
      "E": {
        "name": "Tidecaller's Blessing",
        "description": "Empowers an allied champion for a short duration. The ally's basic attacks and spells deal bonus magic damage and slow the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NamiE.png"
      },
      "R": {
        "name": "Tidal Wave",
        "description": "Summons a massive Tidal Wave that knocks up, slows, and damages enemies. Allies hit gain double the effect of Surging Tides.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NamiR.png"
      }
    }
  },
  {
    "name": "Nasus",
    "class": "the Curator of the Sands",
    "id": "Nasus",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Nasus.png",
    "abilities": {
      "Q": {
        "name": "Siphoning Strike",
        "description": "Nasus strikes his foe, dealing damage and increasing the power of his future Siphoning Strikes if he slays his target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NasusQ.png"
      },
      "W": {
        "name": "Wither",
        "description": "Nasus ages an enemy champion, decelerating their Move Speed and Attack Speed over time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NasusW.png"
      },
      "E": {
        "name": "Spirit Fire",
        "description": "Nasus unleashes a spirit flame at a location, dealing damage and reducing the Armor of enemies who stand on it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NasusE.png"
      },
      "R": {
        "name": "Fury of the Sands",
        "description": "Nasus unleashes a mighty sandstorm that batters nearby enemies. While the storm rages, he gains increased Health, Attack Range, damages nearby enemies, has a reduced cooldown on Siphoning Strike, and gains bonus Armor and Magic Resistance.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NasusR.png"
      }
    }
  },
  {
    "name": "Nautilus",
    "class": "the Titan of the Depths",
    "id": "Nautilus",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Nautilus.png",
    "abilities": {
      "Q": {
        "name": "Dredge Line",
        "description": "Nautilus hurls his anchor forward.  Colliding with an enemy pulls them and Nautilus together, dealing magic damage.  Colliding with terrain pulls Nautilus towards it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NautilusAnchorDrag.png"
      },
      "W": {
        "name": "Titan's Wrath",
        "description": "Nautilus gains a temporary Shield.  While it persists, his Attacks deal damage over time to his target and surrounding enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NautilusPiercingGaze.png"
      },
      "E": {
        "name": "Riptide",
        "description": "Nautilus creates three exploding waves around himself. Each explosion damages and slows enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NautilusSplashZone.png"
      },
      "R": {
        "name": "Depth Charge",
        "description": "Nautilus fires a shockwave into the earth that chases an opponent. This shockwave rips up the earth above it, knocking enemies into the air. When it reaches the opponent, the shockwave erupts, knocking his target into the air and stunning them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NautilusGrandLine.png"
      }
    }
  },
  {
    "name": "Neeko",
    "class": "the Curious Chameleon",
    "id": "Neeko",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Neeko.png",
    "abilities": {
      "Q": {
        "name": "Blooming Burst",
        "description": "Neeko throws a seed dealing magic damage. The seed blooms again on hitting champions or killing units.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NeekoQ.png"
      },
      "W": {
        "name": "Shapesplitter",
        "description": "Neeko passively deals bonus magic damage every third attack, briefly increasing her move speed. Neeko can activate to send a clone in a direction and recast to change the direction of the clone.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NeekoW.png"
      },
      "E": {
        "name": "Tangle-Barbs",
        "description": "Neeko slings a tangle that damages and roots everything it passes through. If the tangle kills an enemy or passes through a champion, it becomes larger, faster, and roots for longer.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NeekoE.png"
      },
      "R": {
        "name": "Pop Blossom",
        "description": "After a short preparation, Neeko leaps into the air, knocking up all nearby enemies. Upon landing, nearby enemies are damaged and stunned. The preparation is hidden if Neeko is disguised.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NeekoR.png"
      }
    }
  },
  {
    "name": "Nidalee",
    "class": "the Bestial Huntress",
    "id": "Nidalee",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Nidalee.png",
    "abilities": {
      "Q": {
        "name": "Javelin Toss / Takedown",
        "description": "In human form, Nidalee throws a spiked javelin at her target that gains damage as it flies.  As a cougar, her next attack will attempt to fatally wound her target, dealing more damage the less life they have.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JavelinToss.png"
      },
      "W": {
        "name": "Bushwhack / Pounce",
        "description": "In human form, Nidalee lays a trap for unwary opponents that, when sprung, damages and reveals its target. As a cougar, she jumps in a direction, dealing damage in an area where she lands.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Bushwhack.png"
      },
      "E": {
        "name": "Primal Surge / Swipe",
        "description": "In human form, Nidalee channels the spirit of the cougar to heal her allies and imbue them with Attack Speed for a short duration. As a cougar, she claws in a direction, dealing damage to enemies in front of her.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PrimalSurge.png"
      },
      "R": {
        "name": "Aspect Of The Cougar",
        "description": "Nidalee transforms into a cougar, gaining new abilities.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/AspectOfTheCougar.png"
      }
    }
  },
  {
    "name": "Nilah",
    "class": "the Joy Unbound",
    "id": "Nilah",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Nilah.png",
    "abilities": {
      "Q": {
        "name": "Formless Blade",
        "description": "With a snap of her whip-blade, Nilah damages any enemies she hits in a straight line in her chosen direction. This action extends her attack range for a short duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NilahQ.png"
      },
      "W": {
        "name": "Jubilant Veil",
        "description": "Nilah envelops herself in mist, increasing her movement speed and allowing her to gracefully dodge all incoming attacks. Any allies she touches during the mist's duration will also gain this effect.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NilahW.png"
      },
      "E": {
        "name": "Slipstream",
        "description": "Nilah enthusiastically dashes toward her target, dealing damage to any enemies she passes through on the way.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NilahE.png"
      },
      "R": {
        "name": "Apotheosis",
        "description": "Twirling her whip-blade in joyful exuberance, Nilah deals damage to enemies around her before pulling them closer with her weapon.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NilahR.png"
      }
    }
  },
  {
    "name": "Nocturne",
    "class": "the Eternal Nightmare",
    "id": "Nocturne",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Nocturne.png",
    "abilities": {
      "Q": {
        "name": "Duskbringer",
        "description": "Nocturne throws a shadow blade that deals damage, leaves a Dusk Trail, and causes champions to leave a Dusk Trail. While on the trail, Nocturne can move through units and has increased Move Speed and Attack Damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NocturneDuskbringer.png"
      },
      "W": {
        "name": "Shroud of Darkness",
        "description": "Nocturne empowers his blades, passively gaining Attack Speed. Activating Shroud of Darkness allows Nocturne to fade into the shadows, creating a magical barrier which blocks a single enemy ability and doubles his passive Attack Speed if successful.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NocturneShroudofDarkness.png"
      },
      "E": {
        "name": "Unspeakable Horror",
        "description": "Nocturne plants a nightmare into his target's mind, dealing damage each second and applying fear to the target if they do not get out of range by the end of the duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NocturneUnspeakableHorror.png"
      },
      "R": {
        "name": "Paranoia",
        "description": "Nocturne reduces the sight radius of all enemy champions and removes their ally vision in the process. He can then launch himself at a nearby enemy champion.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NocturneParanoia.png"
      }
    }
  },
  {
    "name": "Nunu & Willump",
    "class": "the Boy and His Yeti",
    "id": "Nunu",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Nunu.png",
    "abilities": {
      "Q": {
        "name": "Consume",
        "description": "Willump takes a bite out of a minion, monster, or enemy champion, dealing damage and healing himself.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NunuQ.png"
      },
      "W": {
        "name": "Biggest Snowball Ever!",
        "description": "Willump creates a snowball that grows in size and speed as he rolls it.  The snowball damages and knocks up enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NunuW.png"
      },
      "E": {
        "name": "Snowball Barrage",
        "description": "Nunu throws multiple snowballs that damage enemies.  When he's finished, Willump roots any champions or large monsters that were hit by a snowball.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NunuE.png"
      },
      "R": {
        "name": "Absolute Zero",
        "description": "Nunu & Willump create a powerful blizzard in an area that slows enemies and deals massive damage at the end.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/NunuR.png"
      }
    }
  },
  {
    "name": "Olaf",
    "class": "the Berserker",
    "id": "Olaf",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Olaf.png",
    "abilities": {
      "Q": {
        "name": "Undertow",
        "description": "Olaf throws an axe into the ground at a target location, dealing damage to enemies it passes through and reducing their Armor and Move Speed. If Olaf picks up the axe, the ability's cooldown is reset.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OlafAxeThrowCast.png"
      },
      "W": {
        "name": "Tough It Out",
        "description": "Olaf's Attack Speed is increased and he gains a Shield.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OlafFrenziedStrikes.png"
      },
      "E": {
        "name": "Reckless Swing",
        "description": "Olaf attacks with such force that it deals true damage to his target and himself, refunding the Health cost if he destroys the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OlafRecklessStrike.png"
      },
      "R": {
        "name": "Ragnarok",
        "description": "Olaf passively gains increased armor and magic resist. He can activate this ability to become immune to disables for as long as he keeps attacking.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OlafRagnarok.png"
      }
    }
  },
  {
    "name": "Orianna",
    "class": "the Lady of Clockwork",
    "id": "Orianna",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Orianna.png",
    "abilities": {
      "Q": {
        "name": "Command: Attack",
        "description": "Orianna commands her Ball to fire toward a target location, dealing magic damage to targets along the way (deals less damage to subsequent targets). Her Ball remains at the target location after.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OrianaIzunaCommand.png"
      },
      "W": {
        "name": "Command: Dissonance",
        "description": "Orianna commands her Ball to release a pulse of energy, dealing magic damage around it. This leaves a field behind that speeds up allies and slows enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OrianaDissonanceCommand.png"
      },
      "E": {
        "name": "Command: Protect",
        "description": "Orianna commands her Ball to attach to an allied champion, Shielding them and dealing magic damage to any enemies it passes through on the way. Additionally, the Ball grants additional Armor and Magic Resist to the champion it is attached to.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OrianaRedactCommand.png"
      },
      "R": {
        "name": "Command: Shockwave",
        "description": "Orianna commands her Ball to unleash a shockwave, dealing magic damage and launching nearby enemies towards the Ball after a short delay.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OrianaDetonateCommand.png"
      }
    }
  },
  {
    "name": "Ornn",
    "class": "The Fire below the Mountain",
    "id": "Ornn",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Ornn.png",
    "abilities": {
      "Q": {
        "name": "Volcanic Rupture",
        "description": "Ornn slams the ground, sending out a fissure dealing damage and slowing enemies hit. After a small delay, a magma pillar forms at the end location.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OrnnQ.png"
      },
      "W": {
        "name": "Bellows Breath",
        "description": "Ornn advances, breathing fire. Enemies hit by the final gout of flame become Brittle.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OrnnW.png"
      },
      "E": {
        "name": "Searing Charge",
        "description": "Ornn charges, dealing damage to enemies he passes through. If Ornn collides with terrain while charging, the impact creates a shockwave around him which deals damage and knocks up enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OrnnE.png"
      },
      "R": {
        "name": "Call of the Forge God",
        "description": "Ornn summons a massive elemental at a location which travels toward him with increasing speed. Enemies run over by the elemental take damage, are slowed and are made Brittle. Ornn can recast the ability to charge into the elemental, redirecting it in the direction he hits it, causing the elemental to affect any enemies it runs over to be knocked up, dealing the same damage and re-applying Brittle.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/OrnnR.png"
      }
    }
  },
  {
    "name": "Pantheon",
    "class": "the Unbreakable Spear",
    "id": "Pantheon",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Pantheon.png",
    "abilities": {
      "Q": {
        "name": "Comet Spear",
        "description": "Pantheon either thrusts his spear or throws his spear in the chosen direction.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PantheonQ.png"
      },
      "W": {
        "name": "Shield Vault",
        "description": "Pantheon dashes to a target, damaging and stunning them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PantheonW.png"
      },
      "E": {
        "name": "Aegis Assault",
        "description": "Pantheon sets his shield, becoming invulnerable to damage from the front and striking repeatedly with his spear.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PantheonE.png"
      },
      "R": {
        "name": "Grand Starfall",
        "description": "Pantheon composes himself and then leaps into the air, landing at a chosen location as a comet.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PantheonR.png"
      }
    }
  },
  {
    "name": "Poppy",
    "class": "Keeper of the Hammer",
    "id": "Poppy",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Poppy.png",
    "abilities": {
      "Q": {
        "name": "Hammer Shock",
        "description": "Poppy swings her hammer, dealing damage and creating a zone that will slow enemies and explode after a delay.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PoppyQ.png"
      },
      "W": {
        "name": "Steadfast Presence",
        "description": "Poppy passively gains Armor and Magic Resist. This bonus increases when she is low on Health. Poppy can activate Steadfast Presence to gain Move Speed and stop enemy dashes around her. If a dash is stopped, the enemy is slowed and grounded.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PoppyW.png"
      },
      "E": {
        "name": "Heroic Charge",
        "description": "Poppy dashes to the target and pushes it back. If the target is pushed into a wall, it is stunned.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PoppyE.png"
      },
      "R": {
        "name": "Keeper's Verdict",
        "description": "Poppy channels a hammer strike that knocks enemies very far away.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PoppyR.png"
      }
    }
  },
  {
    "name": "Pyke",
    "class": "the Bloodharbor Ripper",
    "id": "Pyke",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Pyke.png",
    "abilities": {
      "Q": {
        "name": "Bone Skewer",
        "description": "Pyke either stabs an enemy in front of him or pulls an enemy towards him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PykeQ.png"
      },
      "W": {
        "name": "Ghostwater Dive",
        "description": "Pyke enters Camouflage and gains significant Move Speed that decays over time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PykeW.png"
      },
      "E": {
        "name": "Phantom Undertow",
        "description": "Pyke dashes and leaves behind a phantom that will return to him, stunning enemy champions along its path.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PykeE.png"
      },
      "R": {
        "name": "Death From Below",
        "description": "Pyke blinks to and executes low health enemies, allowing him to cast this spell again and granting additional gold to an ally who assists.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PykeR.png"
      }
    }
  },
  {
    "name": "Qiyana",
    "class": "Empress of the Elements",
    "id": "Qiyana",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Qiyana.png",
    "abilities": {
      "Q": {
        "name": "Elemental Wrath / Edge of Ixtal",
        "description": "Qiyana swings her weapon, dealing damage with a bonus effect based on her element.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/QiyanaQ.png"
      },
      "W": {
        "name": "Terrashape",
        "description": "Qiyana dashes to a location and enchants her weapon with an element. Her attacks and abilities deal bonus damage while her weapon is enchanted. ",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/QiyanaW.png"
      },
      "E": {
        "name": "Audacity",
        "description": "Qiyana dashes to an enemy, damaging them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/QiyanaE.png"
      },
      "R": {
        "name": "Supreme Display of Talent",
        "description": "Qiyana sends out a shockwave that detonates whatever elements she hits with it, stunning and damaging nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/QiyanaR.png"
      }
    }
  },
  {
    "name": "Quinn",
    "class": "Demacia's Wings",
    "id": "Quinn",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Quinn.png",
    "abilities": {
      "Q": {
        "name": "Blinding Assault",
        "description": "Quinn calls Valor to mark an enemy and hinder its vision before damaging all enemies in the immediate area.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/QuinnQ.png"
      },
      "W": {
        "name": "Heightened Senses",
        "description": "Passively grants Quinn Attack Speed and Move Speed after she attacks a <font color='#FFF673'>Vulnerable</font> target. Activate to have Valor reveal a large area nearby.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/QuinnW.png"
      },
      "E": {
        "name": "Vault",
        "description": "Quinn dashes to an enemy, dealing physical damage and slowing the target's Move Speed. Upon reaching the target, she leaps off the target, briefly interrupting it, and lands near her maximum Attack Range away from the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/QuinnE.png"
      },
      "R": {
        "name": "Behind Enemy Lines",
        "description": "Quinn and Valor team up to fly around at great speed.  Ending the ability casts Skystrike, which deals damage to nearby enemies and marks champions as Vulnerable.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/QuinnR.png"
      }
    }
  },
  {
    "name": "Rakan",
    "class": "The Charmer",
    "id": "Rakan",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Rakan.png",
    "abilities": {
      "Q": {
        "name": "Gleaming Quill",
        "description": "Flings a magical feather that deals magic damage. Striking a champion or epic monster enables Rakan to heal his allies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RakanQ.png"
      },
      "W": {
        "name": "Grand Entrance",
        "description": "Dashes to a location, knocking up nearby enemies on arrival.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RakanW.png"
      },
      "E": {
        "name": "Battle Dance",
        "description": "Flies to an allied champion granting them a shield. Can be re-cast for free for a short duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RakanE.png"
      },
      "R": {
        "name": "The Quickness",
        "description": "Gains Move Speed, charming and dealing magic damage to enemies touched.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RakanR.png"
      }
    }
  },
  {
    "name": "Rammus",
    "class": "the Armordillo",
    "id": "Rammus",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Rammus.png",
    "abilities": {
      "Q": {
        "name": "Powerball",
        "description": "Rammus accelerates in a ball towards his enemies, dealing damage and slowing targets affected by the impact.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PowerBall.png"
      },
      "W": {
        "name": "Defensive Ball Curl",
        "description": "Rammus goes into a defensive formation, vastly increasing his Armor and Magic Resistance, and returning damage to enemies that attack him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/DefensiveBallCurl.png"
      },
      "E": {
        "name": "Frenzying Taunt",
        "description": "Rammus taunts an enemy champion or monster into a reckless assault against him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PuncturingTaunt.png"
      },
      "R": {
        "name": "Soaring Slam",
        "description": "Rammus hops into the air and slams down at a target area, dealing magic damage and slowing enemies. If cast while Rammus is in Powerball, Rammus knocks up enemies near the center as well.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Tremors2.png"
      }
    }
  },
  {
    "name": "Rek'Sai",
    "class": "the Void Burrower",
    "id": "RekSai",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/RekSai.png",
    "abilities": {
      "Q": {
        "name": "Queen's Wrath / Prey Seeker",
        "description": "Rek'Sai's next 3 basic attacks deal bonus Physical Damage to nearby enemies.<br><br>While Burrowed, Rek'Sai launches a burst of void-charged earth that damages and reveals enemies hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RekSaiQ.png"
      },
      "W": {
        "name": "Burrow / Un-burrow",
        "description": "Rek'Sai burrows into the ground, gaining new abilities and increased Move Speed. Her vision range is reduced and she cannot use basic attacks.<br><br>While Burrowed, Rek'Sai may cast Unburrow to knock up and damage nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RekSaiW.png"
      },
      "E": {
        "name": "Furious Bite / Tunnel",
        "description": "Rek'Sai bites her target, dealing physical damage, or bonus true damage if she has max Fury.<br><br>While Burrowed, Rek'Sai creates a re-usable, long lasting tunnel. Enemies can destroy it by standing on top of either entrance.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RekSaiE.png"
      },
      "R": {
        "name": "Void Rush",
        "description": "Rek'Sai passively marks targets by damaging them. She can activate this ability to become briefly untargetable and lunge at a marked target for heavy damage based on their maximum health.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RekSaiR.png"
      }
    }
  },
  {
    "name": "Rell",
    "class": "the Iron Maiden",
    "id": "Rell",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Rell.png",
    "abilities": {
      "Q": {
        "name": "Shattering Strike",
        "description": "Rell deals magic damage to units in a line, breaking their shields and stunning them. ",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RellQ.png"
      },
      "W": {
        "name": "Ferromancy: Crash Down",
        "description": "Mounted: Rell Dismounts, crashing down in her armor, Knocking enemies up and gaining a large Shield. While dismounted, she gains Armor, Magic Resist, Attack Speed, and Attack Range, but is Slowed.<br><br>Dismounted: Rell forms her Mount, gaining a burst of speed and Knocking Up the next enemy she attacks.<br><br>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RellW_Dismount.png"
      },
      "E": {
        "name": "Full Tilt",
        "description": "Passive: Rell gains out of combat Move Speed.<br><br>Active: Rell and an ally gain ramping Move Speed, doubled toward enemies and each other. Her next Attack explodes, dealing magic damage.<br>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RellE.png"
      },
      "R": {
        "name": "Magnet Storm",
        "description": "Rell explodes in a magnetic fury, violently Pulling nearby enemies toward herself. Then Rell constantly Drags nearby enemies toward herself for a short while, dealing magic damage over time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RellR.png"
      }
    }
  },
  {
    "name": "Renata Glasc",
    "class": "the Chem-Baroness",
    "id": "Renata",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Renata.png",
    "abilities": {
      "Q": {
        "name": "Handshake",
        "description": "Renata sends out a missile rooting the first enemy hit, and can recast the ability to throw the unit in a direction.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RenataQ.png"
      },
      "W": {
        "name": "Bailout",
        "description": "Renata buffs an allied champion to fight harder, delaying their death and potentially saving them if they get a takedown.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RenataW.png"
      },
      "E": {
        "name": "Loyalty Program",
        "description": "Renata sends out a pair of chemtech missiles, shielding allies and damaging and slowing enemies hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RenataE.png"
      },
      "R": {
        "name": "Hostile Takeover",
        "description": "Renata sends out a wave of chemicals, causing any enemies hit to go Berserk.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RenataR.png"
      }
    }
  },
  {
    "name": "Renekton",
    "class": "the Butcher of the Sands",
    "id": "Renekton",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Renekton.png",
    "abilities": {
      "Q": {
        "name": "Cull the Meek",
        "description": "Renekton swings his blade, dealing moderate physical damage to all targets around him, and heals for a small portion of the damage dealt. If he has more than 50 Fury, his damage and heal are increased.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RenektonCleave.png"
      },
      "W": {
        "name": "Ruthless Predator",
        "description": "Renekton slashes his target twice, dealing moderate physical damage and stuns them for 0.75 seconds. If Renekton has more than 50 Fury, he slashes his target three times, destroying damage shields on the target, dealing high physical damage, and stunning them for 1.5 seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RenektonPreExecute.png"
      },
      "E": {
        "name": "Slice and Dice",
        "description": "Renekton dashes, dealing damage to units along the way. Empowered, Renekton deals bonus damage and reduces the Armor of units hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RenektonSliceAndDice.png"
      },
      "R": {
        "name": "Dominus",
        "description": "Renekton transforms into the Tyrant form, gaining bonus Health and dealing damage to enemies around him. While in this form, Renekton gains Fury periodically.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RenektonReignOfTheTyrant.png"
      }
    }
  },
  {
    "name": "Rengar",
    "class": "the Pridestalker",
    "id": "Rengar",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Rengar.png",
    "abilities": {
      "Q": {
        "name": "Savagery",
        "description": "Rengar's next Attack brutally stabs his target for bonus damage.<br><br>Ferocity effect: deals increased damage and grants Attack Speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RengarQ.png"
      },
      "W": {
        "name": "Battle Roar",
        "description": "Rengar lets out a battle roar, damaging enemies and healing for some of the recent damage he has taken.<br><br>Ferocity effect: additionally breaks crowd control effects.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RengarW.png"
      },
      "E": {
        "name": "Bola Strike",
        "description": "Rengar throws a bola, slowing the first target hit for a short duration.<br><br>Ferocity effect: roots the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RengarE.png"
      },
      "R": {
        "name": "Thrill of the Hunt",
        "description": "Rengar's predatory instincts take over, <font color='#cd90ee'>Camouflaging</font> him and revealing the nearest enemy champion in a large radius around him. During Thrill of the Hunt, Rengar gains Move Speed and he can leap to the tracked enemy without being in brush, reducing their armor.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RengarR.png"
      }
    }
  },
  {
    "name": "Riven",
    "class": "the Exile",
    "id": "Riven",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Riven.png",
    "abilities": {
      "Q": {
        "name": "Broken Wings",
        "description": "Riven lashes out in a series of strikes. This ability can be reactivated three times in a short time frame with the third hit knocking back nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RivenTriCleave.png"
      },
      "W": {
        "name": "Ki Burst",
        "description": "Riven emits a Ki Burst, damaging and stunning nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RivenMartyr.png"
      },
      "E": {
        "name": "Valor",
        "description": "Riven steps forward a short distance and blocks incoming damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RivenFeint.png"
      },
      "R": {
        "name": "Blade of the Exile",
        "description": "Riven empowers her keepsake weapon with energy, and gains Attack Damage and Range. During this time, she also gains the ability to use Wind Slash, a powerful ranged attack, once.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RivenFengShuiEngine.png"
      }
    }
  },
  {
    "name": "Rumble",
    "class": "the Mechanized Menace",
    "id": "Rumble",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Rumble.png",
    "abilities": {
      "Q": {
        "name": "Flamespitter",
        "description": "Rumble torches opponents in front of him, dealing magic damage in a cone for 3 seconds. While in Danger Zone this damage is increased.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RumbleFlameThrower.png"
      },
      "W": {
        "name": "Scrap Shield",
        "description": "Rumble pulls up a shield, protecting him from damage and granting him a quick burst of speed. While in Danger Zone, the shield strength and speed bonus is increased.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RumbleShield.png"
      },
      "E": {
        "name": "Electro Harpoon",
        "description": "Rumble launches a harpoon, electrocuting his target with magic damage, slowing their Move Speed, and reducing their Magic Resist. Rumble can carry 2 harpoons at a time. While in Danger Zone the damage and slow percentage is increased.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RumbleGrenade.png"
      },
      "R": {
        "name": "The Equalizer",
        "description": "Rumble fires off a group of rockets, creating a wall of flames that damages and slows enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RumbleCarpetBomb.png"
      }
    }
  },
  {
    "name": "Ryze",
    "class": "the Rune Mage",
    "id": "Ryze",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Ryze.png",
    "abilities": {
      "Q": {
        "name": "Overload",
        "description": "Passively, Ryze's other basic abilities reset the cooldown of Overload and charge a rune. When Ryze casts Overload with 2 runes charged, he gains a brief burst of Move Speed.<br><br>On cast, Ryze throws a charge of pure energy in a line, dealing damage to the first enemy struck. If the target has Flux on it, Overload deals extra damage and bounces to nearby enemies with Flux.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RyzeQWrapper.png"
      },
      "W": {
        "name": "Rune Prison",
        "description": "Ryze traps a target in a cage of runes, damaging them and slowing their movement. If the target has Flux on it, they are instead rooted.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RyzeW.png"
      },
      "E": {
        "name": "Spell Flux",
        "description": "Ryze releases an orb of pure magical power that damages an enemy and debuffs all nearby enemies. Ryze's spells have additional effects against the debuffed enemy.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RyzeE.png"
      },
      "R": {
        "name": "Realm Warp",
        "description": "Passively, Overload deals even more damage against targets with Flux.<br><br>On cast, Ryze creates a portal to a nearby location. After a few seconds, allies standing near the portal are teleported to the target location.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/RyzeR.png"
      }
    }
  },
  {
    "name": "Samira",
    "class": "the Desert Rose",
    "id": "Samira",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Samira.png",
    "abilities": {
      "Q": {
        "name": "Flair",
        "description": "Samira fires a shot or swings her sword, dealing damage. If cast during Wild Rush, strike all enemies in her path upon completion.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SamiraQ.png"
      },
      "W": {
        "name": "Blade Whirl",
        "description": "Samira slashes around her, damaging enemies and destroying enemy missiles.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SamiraW.png"
      },
      "E": {
        "name": "Wild Rush",
        "description": "Samira dashes through an enemy (including structures), slashing enemies she passes through and gaining Attack Speed. Killing an enemy champion refreshes this ability's cooldown.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SamiraE.png"
      },
      "R": {
        "name": "Inferno Trigger",
        "description": "Samira unleashes a torrent of shots from her weapons, wildly shooting all enemies surrounding her.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SamiraR.png"
      }
    }
  },
  {
    "name": "Sejuani",
    "class": "Fury of the North",
    "id": "Sejuani",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Sejuani.png",
    "abilities": {
      "Q": {
        "name": "Arctic Assault",
        "description": "Sejuani charges forward, knocking enemies into the air. The charge stops after hitting an enemy champion.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SejuaniQ.png"
      },
      "W": {
        "name": "Winter's Wrath",
        "description": "Sejuani swings her mace twice, dealing damage, slowing enemies and applying Frost stacks.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SejuaniW.png"
      },
      "E": {
        "name": "Permafrost",
        "description": "Sejuani freezes and stuns an enemy champion that has maximum Frost stacks.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SejuaniE.png"
      },
      "R": {
        "name": "Glacial Prison",
        "description": "Sejuani throws her bola that freezes and stuns the first champion hit and creates an ice storm that slows other enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SejuaniR.png"
      }
    }
  },
  {
    "name": "Senna",
    "class": "the Redeemer",
    "id": "Senna",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Senna.png",
    "abilities": {
      "Q": {
        "name": "Piercing Darkness",
        "description": "From the twin barrels of her Relic Cannon, Senna fires a unified beam of light and shadow through a target, healing allies and damaging enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SennaQ.png"
      },
      "W": {
        "name": "Last Embrace",
        "description": "Senna sends forth a wave of Black Mist. If it hits an enemy it latches onto them hungrily, rooting them and everything nearby after a brief delay.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SennaW.png"
      },
      "E": {
        "name": "Curse of the Black Mist",
        "description": "Senna draws the Mist she has stored in her weapon into a storm around her, embracing darkness and becoming a wraith within. Allies who enter the area are camouflaged and also appear as wraiths as the Mist shrouds them. Wraiths gain increased Move Speed, are unselectable, and hide their identities.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SennaE.png"
      },
      "R": {
        "name": "Dawning Shadow",
        "description": "Senna calls upon the relic stones of fallen Sentinels, splitting her relic cannon into a holy array of shadow and light. She then fires a global beam that shields allies from harm, while damaging enemies caught in the center.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SennaR.png"
      }
    }
  },
  {
    "name": "Seraphine",
    "class": "the Starry-Eyed Songstress",
    "id": "Seraphine",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Seraphine.png",
    "abilities": {
      "Q": {
        "name": "High Note",
        "description": "Seraphine deals damage in an area.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SeraphineQ.png"
      },
      "W": {
        "name": "Surround Sound",
        "description": "Seraphine Shields and Hastes nearby allies. If she is already Shielded she will Heal nearby allies as well.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SeraphineW.png"
      },
      "E": {
        "name": "Beat Drop",
        "description": "Seraphine deals damage and impairs the movement of enemies in a line.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SeraphineE.png"
      },
      "R": {
        "name": "Encore",
        "description": "Seraphine deals damage and charms enemies hit, refreshing the range with every allied or enemy champion hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SeraphineR.png"
      }
    }
  },
  {
    "name": "Sett",
    "class": "the Boss",
    "id": "Sett",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Sett.png",
    "abilities": {
      "Q": {
        "name": "Knuckle Down",
        "description": "Sett's next two attacks deal additional damage based off of the target's max health. Sett also gains Move Speed while moving towards enemy champions.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SettQ.png"
      },
      "W": {
        "name": "Haymaker",
        "description": "Sett passively stores damage he takes as Grit. On cast, Sett expends all stored Grit to gain a shield and punch an area, dealing true damage in the center and physical damage on the sides.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SettW.png"
      },
      "E": {
        "name": "Facebreaker",
        "description": "Sett pulls in all enemies on opposite sides of him, dealing damage and stunning them. If enemies were only on one side, they are slowed instead of stunned.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SettE.png"
      },
      "R": {
        "name": "The Show Stopper",
        "description": "Sett carries an enemy champion through the air and slams them into the ground, dealing damage and slowing all enemies near where they land.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SettR.png"
      }
    }
  },
  {
    "name": "Shaco",
    "class": "the Demon Jester",
    "id": "Shaco",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Shaco.png",
    "abilities": {
      "Q": {
        "name": "Deceive",
        "description": "Shaco becomes Invisible and teleports to target location.<br><br>His first attack while Invisible is empowered, dealing bonus damage and critically striking if he attacks from behind.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Deceive.png"
      },
      "W": {
        "name": "Jack In The Box",
        "description": "Shaco creates a hidden animated Jack-in-the-Box. When triggered, it will fear and attack nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/JackInTheBox.png"
      },
      "E": {
        "name": "Two-Shiv Poison",
        "description": "Shaco's Shivs passively poison targets on hit, slowing their Move Speed. He can throw his Shivs to deal damage and poison the target. The thrown Shiv deals bonus damage if the target is below 30% health.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TwoShivPoison.png"
      },
      "R": {
        "name": "Hallucinate",
        "description": "Shaco creates an illusion of himself near him, which can attack nearby enemies (Deals reduced damage to turrets).  Upon death, it explodes, spawning three mini Jack in the Boxes and dealing damage to nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/HallucinateFull.png"
      }
    }
  },
  {
    "name": "Shen",
    "class": "the Eye of Twilight",
    "id": "Shen",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Shen.png",
    "abilities": {
      "Q": {
        "name": "Twilight Assault",
        "description": "Shen recalls his spirit blade to attack with it, dealing damage based on the target's max health. The attacks are greatly empowered if it collides with an enemy champion, and all collided enemies are slowed while running away from Shen.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ShenQ.png"
      },
      "W": {
        "name": "Spirit's Refuge",
        "description": "Attacks that would hit Shen or his allies near his spirit blade are blocked.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ShenW.png"
      },
      "E": {
        "name": "Shadow Dash",
        "description": "Shen dashes in a direction, taunting enemies in his path.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ShenE.png"
      },
      "R": {
        "name": "Stand United",
        "description": "Shen shields target allied champion from incoming damage, and soon after teleports to their location.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ShenR.png"
      }
    }
  },
  {
    "name": "Shyvana",
    "class": "the Half-Dragon",
    "id": "Shyvana",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Shyvana.png",
    "abilities": {
      "Q": {
        "name": "Twin Bite",
        "description": "Shyvana strikes twice on her next attack and grants herself Attack Speed for her next attacks. Basic attacks reduce the cooldown of Twin Bite by 0.5 seconds.<br><br><font color='#FF3300'>Dragon Form: </font>Twin Bite cleaves all units in front of Shyvana.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ShyvanaDoubleAttack.png"
      },
      "W": {
        "name": "Burnout",
        "description": "Shyvana surrounds herself in fire, dealing magic damage per second to nearby enemies and moving faster for 3 seconds, part of this damage is applied again when Shyvana basic attacks an enemy with Burnout active. The Move Speed reduces over the duration of the spell. Basic attacks extend the duration of Burnout. <br><br><font color='#FF3300'>Dragon Form: </font>Burnout grows in size.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ShyvanaImmolationAura.png"
      },
      "E": {
        "name": "Flame Breath",
        "description": "Shyvana unleashes a fireball that deals damage to all enemies it encounters and leaves cinders on the target, marking them for 5 seconds. Shyvana's basic attacks on marked targets deal a percentage of their maximum Health as damage on-hit.<br><br><font color='#FF3300'>Dragon Form: </font>Flame Breath explodes on impact or at target location, dealing bonus damage and scorching the earth for a short duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ShyvanaFireball.png"
      },
      "R": {
        "name": "Dragon's Descent",
        "description": "Shyvana transforms into a dragon and takes flight to a target location. Enemies along her path take damage and are knocked toward her target location.<br><br>Shyvana passively gains Fury per second and gains 2 Fury on basic attack.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ShyvanaTransformCast.png"
      }
    }
  },
  {
    "name": "Singed",
    "class": "the Mad Chemist",
    "id": "Singed",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Singed.png",
    "abilities": {
      "Q": {
        "name": "Poison Trail",
        "description": "Leaves a trail of poison behind Singed, dealing damage to enemies caught in the path.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PoisonTrail.png"
      },
      "W": {
        "name": "Mega Adhesive",
        "description": "Throws a vial of mega adhesive on the ground, slowing and grounding enemies who walk on it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/MegaAdhesive.png"
      },
      "E": {
        "name": "Fling",
        "description": "Damages target enemy unit and flings them into the air behind Singed. If the target Singed flings lands in his Mega Adhesive, they are also rooted.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Fling.png"
      },
      "R": {
        "name": "Insanity Potion",
        "description": "Singed drinks a potent brew of chemicals, granting him increased combat stats, and making his Poison Trail apply Grievous Wounds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/InsanityPotion.png"
      }
    }
  },
  {
    "name": "Sion",
    "class": "The Undead Juggernaut",
    "id": "Sion",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Sion.png",
    "abilities": {
      "Q": {
        "name": "Decimating Smash",
        "description": "Sion charges a powerful swing in an area in front of himself that will deal damage to enemies when released. If he charges for enough time, enemies hit by the swing will also be knocked up and stunned.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SionQ.png"
      },
      "W": {
        "name": "Soul Furnace",
        "description": "Sion shields himself and can reactivate after 3 seconds to deal Magic Damage to enemies nearby. When Sion kills enemies, he passively gains maximum Health.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SionW.png"
      },
      "E": {
        "name": "Roar of the Slayer",
        "description": "Sion fires a short range shockwave that damages and slows and reduces the Armor of the first enemy hit. If the shockwave hits a minion or monster, it will be knocked back, damaging, slowing, and reducing the Armor of all enemies that it passes through.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SionE.png"
      },
      "R": {
        "name": "Unstoppable Onslaught",
        "description": "Sion charges in a direction, ramping up speed over time. He can steer his charge slightly with the mouse cursor location. When he collides with an enemy he deals damage and knocks them up based on the distance he has charged.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SionR.png"
      }
    }
  },
  {
    "name": "Sivir",
    "class": "the Battle Mistress",
    "id": "Sivir",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Sivir.png",
    "abilities": {
      "Q": {
        "name": "Boomerang Blade",
        "description": "Sivir hurls her crossblade like a boomerang, dealing damage each way.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SivirQ.png"
      },
      "W": {
        "name": "Ricochet",
        "description": "Sivir's next few basic attacks gain additional attack speed and bounce to nearby targets, dealing reduced damage while bouncing.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SivirW.png"
      },
      "E": {
        "name": "Spell Shield",
        "description": "Creates a magical barrier that blocks a single enemy ability cast on Sivir. She receives health and a burst of movement speed if a spell is blocked.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SivirE.png"
      },
      "R": {
        "name": "On The Hunt",
        "description": "Sivir leads her allies in battle, granting them a surge of Move Speed for a period of time. In addition, Sivir's attacks reduce her spell cooldowns.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SivirR.png"
      }
    }
  },
  {
    "name": "Skarner",
    "class": "the Primordial Sovereign",
    "id": "Skarner",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Skarner.png",
    "abilities": {
      "Q": {
        "name": "Shattered Earth / Upheaval",
        "description": "Skarner rips a boulder from the earth that empowers his attacks and can be thrown as a powerful projectile.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SkarnerQ.png"
      },
      "W": {
        "name": "Seismic Bastion",
        "description": "Skarner gains a shield and creates an earthquake whose shockwave damages and slows foes.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SkarnerW.png"
      },
      "E": {
        "name": "Ixtal's Impact",
        "description": "Skarner charges forward and passes through terrain. If he collides with a champion or large monster, he'll slam them into the next wall he hits to damage and stun them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SkarnerE.png"
      },
      "R": {
        "name": "Impale",
        "description": "Skarner's tails lash forward to suppress enemy champions. Once suppressed, the victims will be dragged along by Skarner as he moves around.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SkarnerR.png"
      }
    }
  },
  {
    "name": "Smolder",
    "class": "the Fiery Fledgling",
    "id": "Smolder",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Smolder.png",
    "abilities": {
      "Q": {
        "name": "Super Scorcher Breath",
        "description": "Smolder breathes fire on an enemy. As he gains more stacks, this ability becomes more powerful.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SmolderQ.png"
      },
      "W": {
        "name": "Achooo!",
        "description": "Smolder lets out an adorable flaming sneeze that explodes when hitting enemy champions.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SmolderW.png"
      },
      "E": {
        "name": "Flap, Flap, Flap",
        "description": "Smolder takes flight ignoring terrain and bombarding the lowest health enemy.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SmolderE.png"
      },
      "R": {
        "name": "MMOOOMMMM!",
        "description": "Smolder calls his mom to breath fire from above, dealing extra damage and slowing enemies in the center of her fire.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SmolderR.png"
      }
    }
  },
  {
    "name": "Sona",
    "class": "Maven of the Strings",
    "id": "Sona",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Sona.png",
    "abilities": {
      "Q": {
        "name": "Hymn of Valor",
        "description": "Sona plays the Hymn of Valor, sends out bolts of sound, dealing magic damage to two nearby enemies, prioritizing champions and monsters. Sona gains a temporary aura that grants allies tagged by the zone bonus damage on their next attack against enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SonaQ.png"
      },
      "W": {
        "name": "Aria of Perseverance",
        "description": "Sona plays the Aria of Perseverance, sending out protective melodies, healing Sona and a nearby wounded ally. Sona gains a temporary aura that grants allies tagged by the zone a temporary shield.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SonaW.png"
      },
      "E": {
        "name": "Song of Celerity",
        "description": "Sona plays the Song of Celerity, granting nearby allies bonus Move Speed. Sona gains a temporary aura that grants allied champions tagged by the zone bonus Move Speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SonaE.png"
      },
      "R": {
        "name": "Crescendo",
        "description": "Sona plays her ultimate chord, stunning enemy champions and forcing them to dance and dealing magic damage to them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SonaR.png"
      }
    }
  },
  {
    "name": "Soraka",
    "class": "the Starchild",
    "id": "Soraka",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Soraka.png",
    "abilities": {
      "Q": {
        "name": "Starcall",
        "description": "A star falls from the sky at the target location dealing magic damage and slowing enemies. If an enemy champion is hit by Starcall, Soraka recovers Health.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SorakaQ.png"
      },
      "W": {
        "name": "Astral Infusion",
        "description": "Soraka sacrifices a portion of her own health to heal another friendly champion.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SorakaW.png"
      },
      "E": {
        "name": "Equinox",
        "description": "Creates a zone at a location that silences all enemies inside. When the zone expires, all enemies still inside are rooted.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SorakaE.png"
      },
      "R": {
        "name": "Wish",
        "description": "Soraka fills her allies with hope, instantly restoring health to herself and all allied champions.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SorakaR.png"
      }
    }
  },
  {
    "name": "Swain",
    "class": "the Noxian Grand General",
    "id": "Swain",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Swain.png",
    "abilities": {
      "Q": {
        "name": "Death's Hand",
        "description": "Swain unleashes several bolts of eldritch power that pierce through enemies. Enemies hit take more damage for each bolt they are struck by.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SwainQ.png"
      },
      "W": {
        "name": "Vision of Empire",
        "description": "Swain opens a demon eye that deals damage and slows enemies. Champions hit are revealed and also grant Swain a Soul Fragment.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SwainW.png"
      },
      "E": {
        "name": "Nevermove",
        "description": "Swain launches a wave of demonic power forward. It then returns to Swain and roots enemies it hits. Swain can then choose to pull all rooted champions closer. This ability has a shorter cooldown during Demonic Ascension.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SwainE.png"
      },
      "R": {
        "name": "Demonic Ascension",
        "description": "Swain transforms into a demon and drains health from nearby enemy champions, minions, and neutral monsters. Swain can cast Demonflare to decimate and slow nearby enemies with a nova of soulfire. This form is indefinite as long as Swain drains enemy champions.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SwainR.png"
      }
    }
  },
  {
    "name": "Sylas",
    "class": "the Unshackled",
    "id": "Sylas",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Sylas.png",
    "abilities": {
      "Q": {
        "name": "Chain Lash",
        "description": "Sylas lashes his chains out, intersecting at his targeted location dealing damage to and slowing enemies. <br><br>After a delay, magical energy explodes from the intersection point dealing damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SylasQ.png"
      },
      "W": {
        "name": "Kingslayer",
        "description": "Sylas lunges at an enemy with magical force dealing damage and healing himself against enemy champions.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SylasW.png"
      },
      "E": {
        "name": "Abscond / Abduct",
        "description": "Sylas dashes to a location. Sylas can recast the ability to throw his chains out, pulling himself to an enemy he hits.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SylasE.png"
      },
      "R": {
        "name": "Hijack",
        "description": "Sylas steals the enemy's ultimate ability and can cast it freely.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SylasR.png"
      }
    }
  },
  {
    "name": "Syndra",
    "class": "the Dark Sovereign",
    "id": "Syndra",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Syndra.png",
    "abilities": {
      "Q": {
        "name": "Dark Sphere",
        "description": "Syndra conjures a Dark Sphere dealing magic damage. The sphere remains and can be manipulated by her other powers.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SyndraQ.png"
      },
      "W": {
        "name": "Force of Will",
        "description": "Syndra picks up and throws a Dark Sphere or enemy minion dealing magic damage and slowing the Move Speed of enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SyndraW.png"
      },
      "E": {
        "name": "Scatter the Weak",
        "description": "Syndra knocks enemies and Dark Spheres back dealing magic damage. Enemies hit by Dark Spheres become stunned.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SyndraE.png"
      },
      "R": {
        "name": "Unleashed Power",
        "description": "Syndra bombards an enemy Champion with all of her Dark Spheres.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/SyndraR.png"
      }
    }
  },
  {
    "name": "Tahm Kench",
    "class": "The River King",
    "id": "TahmKench",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/TahmKench.png",
    "abilities": {
      "Q": {
        "name": "Tongue Lash",
        "description": "Tahm Kench lashes out with his tongue, damaging and slowing the first unit hit and healing himself if he strikes an enemy champion.<br><br>Applies a stack of  <spellName>An Acquired Taste</spellName> to enemy champions. If the champion already has 3 stacks of <spellName>An Acquired Taste</spellName>, they are stunned and the stacks are consumed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TahmKenchQ.png"
      },
      "W": {
        "name": "Abyssal Dive",
        "description": "Dive down and then re-appear at target location, damaging and knocking up all enemies in an area.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TahmKenchW.png"
      },
      "E": {
        "name": "Thick Skin",
        "description": "<passive>Passive:</passive> Tahm Kench stores a percent of the damage he takes and heals based on it while out of combat.<br><br><active>Active:</active> Convert all stored damage into a temporary shield.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TahmKenchE.png"
      },
      "R": {
        "name": "Devour",
        "description": "Tahm Kench devours a champion for a few seconds, dealing magic damage if they are an enemy, or shielding them if they are an ally.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TahmKenchRWrapper.png"
      }
    }
  },
  {
    "name": "Taliyah",
    "class": "the Stoneweaver",
    "id": "Taliyah",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Taliyah.png",
    "abilities": {
      "Q": {
        "name": "Threaded Volley",
        "description": "Taliyah throws a volley of rocks in a target direction, moving freely as she casts. This creates Worked Ground below her. If Taliyah casts Threaded Volley on Worked Ground, she consumes the ground to throw a stronger boulder that slows enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TaliyahQ.png"
      },
      "W": {
        "name": "Seismic Shove",
        "description": "Taliyah causes an area of ground to erupt and throws enemies within it in a direction of her choosing.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TaliyahWVC.png"
      },
      "E": {
        "name": "Unraveled Earth",
        "description": "Taliyah creates a slowing minefield. If enemies dash through it or are knocked through it, the mines explode and stun them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TaliyahE.png"
      },
      "R": {
        "name": "Weaver's Wall",
        "description": "Taliyah creates a very long wall and then surfs it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TaliyahR.png"
      }
    }
  },
  {
    "name": "Talon",
    "class": "the Blade's Shadow",
    "id": "Talon",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Talon.png",
    "abilities": {
      "Q": {
        "name": "Noxian Diplomacy",
        "description": "Talon stabs the target unit. If they are within melee range, this attack deals critical damage. If they are outside melee range, Talon will leap at his target before stabbing them. Talon refunds some health and cooldown if this ability kills the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TalonQ.png"
      },
      "W": {
        "name": "Rake",
        "description": "Talon sends out a volley of daggers that then return back to him, dealing physical damage every time it passes through an enemy. The returning blades deal bonus damage and slow units hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TalonW.png"
      },
      "E": {
        "name": "Assassin's Path",
        "description": "Talon vaults over any terrain or structure, up to a max distance. This ability has a low cooldown, but puts the used terrain on a long cooldown.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TalonE.png"
      },
      "R": {
        "name": "Shadow Assault",
        "description": "Talon disperses a ring of blades and becomes Invisible while gaining additional Move Speed. When Talon emerges from Invisibility, the blades converge on his location. Each time the blades move, Shadow Assault deals physical damage to enemies hit by at least one blade.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TalonR.png"
      }
    }
  },
  {
    "name": "Taric",
    "class": "the Shield of Valoran",
    "id": "Taric",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Taric.png",
    "abilities": {
      "Q": {
        "name": "Starlight's Touch",
        "description": "Heals nearby allied champions based on charges stored. Bravado-empowered attacks grant a charge of Starlight's Touch.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TaricQ.png"
      },
      "W": {
        "name": "Bastion",
        "description": "Passively increase the Armor of Taric and any allied champion with Bastion.<br><br>Actively shields an ally and grants them Bastion for as long as they remain near Taric. Taric's spells also cast off the ally with Bastion.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TaricW.png"
      },
      "E": {
        "name": "Dazzle",
        "description": "Taric readies a beam of starlight that, after a brief delay, deals magic damage and stuns enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TaricE.png"
      },
      "R": {
        "name": "Cosmic Radiance",
        "description": "Pulses cosmic energy onto nearby allied champions after a delay, making them invulnerable for a short duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TaricR.png"
      }
    }
  },
  {
    "name": "Teemo",
    "class": "the Swift Scout",
    "id": "Teemo",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Teemo.png",
    "abilities": {
      "Q": {
        "name": "Blinding Dart",
        "description": "Obscures an enemy's vision with a powerful venom, dealing damage to the target unit and blinding it for the duration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TeemoQ.png"
      },
      "W": {
        "name": "Move Quick",
        "description": "Teemo scampers around, passively increasing his Move Speed until he is struck by an enemy champion or turret. Teemo can sprint to gain bonus Move Speed that isn't stopped by being struck for a short time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TeemoW.png"
      },
      "E": {
        "name": "Toxic Shot",
        "description": "Each of Teemo's attacks will poison the target, dealing damage on impact and each second after for 4 seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TeemoE.png"
      },
      "R": {
        "name": "Noxious Trap",
        "description": "Teemo throws an explosive poisonous trap using one of the mushrooms stored in his pack. If an enemy steps on the trap, it will release a poisonous cloud, slowing enemies and damaging them over time. If Teemo throws a mushroom onto another mushroom it will bounce, gaining additional range.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TeemoR.png"
      }
    }
  },
  {
    "name": "Thresh",
    "class": "the Chain Warden",
    "id": "Thresh",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Thresh.png",
    "abilities": {
      "Q": {
        "name": "Death Sentence",
        "description": "Thresh binds an enemy in chains and pulls them toward him. Activating this ability a second time pulls Thresh to the enemy.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ThreshQ.png"
      },
      "W": {
        "name": "Dark Passage",
        "description": "Thresh throws out a lantern that shields nearby allied Champions from damage. Allies can click the lantern to dash to Thresh.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ThreshW.png"
      },
      "E": {
        "name": "Flay",
        "description": "Thresh's attacks wind up, dealing more damage the longer he waits between attacks. When activated, Thresh sweeps his chain, knocking all enemies hit in the direction of the blow.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ThreshE.png"
      },
      "R": {
        "name": "The Box",
        "description": "A prison of walls that slow and deal damage if broken.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ThreshRPenta.png"
      }
    }
  },
  {
    "name": "Tristana",
    "class": "the Yordle Gunner",
    "id": "Tristana",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Tristana.png",
    "abilities": {
      "Q": {
        "name": "Rapid Fire",
        "description": "Tristana fires her weapon rapidly, increasing her Attack Speed for a short time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TristanaQ.png"
      },
      "W": {
        "name": "Rocket Jump",
        "description": "Tristana fires at the ground to propel her to a distant location, dealing damage and slowing surrounding units for a brief period where she lands.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TristanaW.png"
      },
      "E": {
        "name": "Explosive Charge",
        "description": "When Tristana kills a unit, her cannonballs burst into shrapnel, dealing damage to surrounding enemies. Can be activated to place a bomb on a target enemy that explodes after a short duration dealing damage to surrounding units.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TristanaE.png"
      },
      "R": {
        "name": "Buster Shot",
        "description": "Tristana loads a massive cannonball into her weapon and fires it at an enemy unit. This deals Magic Damage and knocks the target back. If the target is carrying the Explosive Charge bomb, the bomb detonation radius is doubled.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TristanaR.png"
      }
    }
  },
  {
    "name": "Trundle",
    "class": "the Troll King",
    "id": "Trundle",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Trundle.png",
    "abilities": {
      "Q": {
        "name": "Chomp",
        "description": "Trundle bites his opponent, dealing damage, briefly slowing and sapping some of their Attack Damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TrundleTrollSmash.png"
      },
      "W": {
        "name": "Frozen Domain",
        "description": "Trundle turns target location into his domain, gaining Attack Speed, Move Speed, and increased healing from all sources while on it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/trundledesecrate.png"
      },
      "E": {
        "name": "Pillar of Ice",
        "description": "Trundle creates an ice pillar at target location, becoming impassable terrain and slowing all nearby enemy units.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TrundleCircle.png"
      },
      "R": {
        "name": "Subjugate",
        "description": "Trundle immediately steals a percent of his target's Health, Armor and Magic Resistance. Over the next 4 seconds the amount of Health, Armor, and Magic Resistance stolen is doubled.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TrundlePain.png"
      }
    }
  },
  {
    "name": "Tryndamere",
    "class": "the Barbarian King",
    "id": "Tryndamere",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Tryndamere.png",
    "abilities": {
      "Q": {
        "name": "Bloodlust",
        "description": "Tryndamere thrives on the thrills of combat, increasing his Attack Damage as he is more and more wounded. He can cast Bloodlust to consume his Fury and heal himself.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TryndamereQ.png"
      },
      "W": {
        "name": "Mocking Shout",
        "description": "Tryndamere lets out an insulting cry, decreasing surrounding champions' Attack Damage. Enemies with their backs turned to Tryndamere also have their Move Speed reduced.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TryndamereW.png"
      },
      "E": {
        "name": "Spinning Slash",
        "description": "Tryndamere slices toward a target unit, dealing damage to enemies in his path.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TryndamereE.png"
      },
      "R": {
        "name": "Undying Rage",
        "description": "Tryndamere's lust for battle becomes so strong that he is unable to die, no matter how wounded he becomes.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/UndyingRage.png"
      }
    }
  },
  {
    "name": "Twisted Fate",
    "class": "the Card Master",
    "id": "TwistedFate",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/TwistedFate.png",
    "abilities": {
      "Q": {
        "name": "Wild Cards",
        "description": "Twisted Fate throws three cards, dealing damage to each enemy unit they pass through.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/WildCards.png"
      },
      "W": {
        "name": "Pick a Card",
        "description": "Twisted Fate chooses a magic card from his deck, and uses that for his next attack, causing bonus effects.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/PickACard.png"
      },
      "E": {
        "name": "Stacked Deck",
        "description": "Every 4 attacks, Twisted Fate deals bonus damage. In addition, his Attack Speed is increased.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/CardmasterStack.png"
      },
      "R": {
        "name": "Destiny",
        "description": "Twisted Fate predicts the fortunes of his foes, revealing all enemy champions and enabling the use of Gate, which teleports Twisted Fate to any target location in 1.5 seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/Destiny.png"
      }
    }
  },
  {
    "name": "Twitch",
    "class": "the Plague Rat",
    "id": "Twitch",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Twitch.png",
    "abilities": {
      "Q": {
        "name": "Ambush",
        "description": "Twitch becomes Camouflaged for a short duration and gains Move Speed. When leaving Camouflage, Twitch gains Attack Speed for a short duration.<br><br>When an enemy champion with Deadly Venom dies, Ambush's cooldown is reset.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TwitchHideInShadows.png"
      },
      "W": {
        "name": "Venom Cask",
        "description": "Twitch hurls a cask of venom that explodes in an area, slowing targets and applying deadly venom to the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TwitchVenomCask.png"
      },
      "E": {
        "name": "Contaminate",
        "description": "Twitch wreaks further havoc on poisoned enemies with a blast of his vile diseases.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TwitchExpunge.png"
      },
      "R": {
        "name": "Spray and Pray",
        "description": "Twitch unleashes the full power of his crossbow, shooting bolts over a great distance that pierce all enemies caught in their path.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TwitchFullAutomatic.png"
      }
    }
  },
  {
    "name": "Udyr",
    "class": "the Spirit Walker",
    "id": "Udyr",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Udyr.png",
    "abilities": {
      "Q": {
        "name": "Wilding Claw",
        "description": "Udyr gains attack speed and his next two attacks deal bonus physical damage. Recast: Gain even more attack speed, and the next two attacks call lightning to strike the target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/UdyrQ.png"
      },
      "W": {
        "name": "Iron Mantle",
        "description": "Udyr gains a shield and his next two attacks heal him. Recast: Gain an even bigger shield and heal based on max health over the next couple seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/UdyrW.png"
      },
      "E": {
        "name": "Blazing Stampede",
        "description": "Udyr gains movement speed and his first attack against each target will Stun them. Recast: Gain even more movement speed and immunity to immobilizing effects for a couple seconds. ",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/UdyrE.png"
      },
      "R": {
        "name": "Wingborne Storm",
        "description": "Udyr surrounds himself in a glacial storm, damaging and slowing nearby enemies. Recast: Empower and unleash the storm, causing it to track enemies and deal additional damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/UdyrR.png"
      }
    }
  },
  {
    "name": "Urgot",
    "class": "the Dreadnought",
    "id": "Urgot",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Urgot.png",
    "abilities": {
      "Q": {
        "name": "Corrosive Charge",
        "description": "Fires an explosive charge at the target location, dealing physical damage and slowing enemies caught in the explosion.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/UrgotQ.png"
      },
      "W": {
        "name": "Purge",
        "description": "Urgot slows himself while he unloads his weapon on nearby enemies. Prioritizes enemy champions Urgot has recently struck with other abilities and triggers Echoing Flames.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/UrgotW.png"
      },
      "E": {
        "name": "Disdain",
        "description": "Urgot charges in a direction, shielding himself and trampling non-champion enemies. If he catches an enemy champion, he will stop and hurl them out of his way.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/UrgotE.png"
      },
      "R": {
        "name": "Fear Beyond Death",
        "description": "Urgot fires a chem-drill that impales the first enemy champion hit. If that champion falls below a health threshold, Urgot judges them weak and can execute them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/UrgotR.png"
      }
    }
  },
  {
    "name": "Varus",
    "class": "the Arrow of Retribution",
    "id": "Varus",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Varus.png",
    "abilities": {
      "Q": {
        "name": "Piercing Arrow",
        "description": "Varus readies and then fires a powerful shot that gains extra range and damage the longer he spends preparing to fire.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VarusQ.png"
      },
      "W": {
        "name": "Blighted Quiver",
        "description": "Passive: Varus' basic attacks deal bonus magic damage and apply Blight. Varus' other abilities detonate Blight, dealing magic damage based on the target's maximum Health. Active: Varus empowers his next Piercing Arrow.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VarusW.png"
      },
      "E": {
        "name": "Hail of Arrows",
        "description": "Varus fires a hail of arrows that deal physical damage and desecrate the ground. Desecrated ground slows enemies' Move Speed and reduces their self healing and regeneration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VarusE.png"
      },
      "R": {
        "name": "Chain of Corruption",
        "description": "Varus flings out a damaging tendril of corruption that immobilizes the first enemy champion hit and then spreads towards nearby uninfected champions, immobilizing them too on contact.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VarusR.png"
      }
    }
  },
  {
    "name": "Vayne",
    "class": "the Night Hunter",
    "id": "Vayne",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Vayne.png",
    "abilities": {
      "Q": {
        "name": "Tumble",
        "description": "Vayne tumbles, maneuvering to carefully place her next shot. Her next attack deals bonus damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VayneTumble.png"
      },
      "W": {
        "name": "Silver Bolts",
        "description": "Vayne tips her bolts with a rare metal, toxic to evil things. The third consecutive attack or ability against the same target deals a percentage of the target's max health as bonus true damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VayneSilveredBolts.png"
      },
      "E": {
        "name": "Condemn",
        "description": "Vayne draws a heavy crossbow from her back, and fires a huge bolt at her target, knocking them back and dealing damage. If they collide with terrain, they are impaled, dealing bonus damage and stunning them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VayneCondemn.png"
      },
      "R": {
        "name": "Final Hour",
        "description": "Readying herself for an epic confrontation, Vayne gains increased Attack Damage, Invisibility during Tumble, reduced Tumble cooldown, and more bonus Move Speed from Night Hunter",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VayneInquisition.png"
      }
    }
  },
  {
    "name": "Veigar",
    "class": "the Tiny Master of Evil",
    "id": "Veigar",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Veigar.png",
    "abilities": {
      "Q": {
        "name": "Baleful Strike",
        "description": "Veigar unleashes a bolt of dark energy that deals magic damage to the first two enemies hit. Units killed by this bolt grant Veigar some ability power permanently.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VeigarBalefulStrike.png"
      },
      "W": {
        "name": "Dark Matter",
        "description": "Veigar calls a great mass of dark matter to fall from the sky to the target location, dealing magic damage when it lands. Stacks of Phenomenal Evil reduce Dark Matter's cooldown.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VeigarDarkMatter.png"
      },
      "E": {
        "name": "Event Horizon",
        "description": "Veigar twists the edges of space, creating a cage that Stuns enemies that pass through.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VeigarEventHorizon.png"
      },
      "R": {
        "name": "Primordial Burst",
        "description": "Blasts target enemy champion, dealing a large amount of magic damage, increasing based on the target's missing health.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VeigarR.png"
      }
    }
  },
  {
    "name": "Vel'Koz",
    "class": "the Eye of the Void",
    "id": "Velkoz",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Velkoz.png",
    "abilities": {
      "Q": {
        "name": "Plasma Fission",
        "description": "Vel'Koz shoots a bolt of plasma that splits in two on reactivation or upon hitting an enemy. The bolt slows and damages on hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VelkozQ.png"
      },
      "W": {
        "name": "Void Rift",
        "description": "Vel'Koz opens a rift to the void that deals an initial burst of damage, then explodes for a second burst of damage after a delay.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VelkozW.png"
      },
      "E": {
        "name": "Tectonic Disruption",
        "description": "Vel'Koz causes an area to explode, knocking up enemies, and knocking close enemies slightly away.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VelkozE.png"
      },
      "R": {
        "name": "Life Form Disintegration Ray",
        "description": "Vel'Koz unleashes a channelled beam that follows the cursor for 2.5 seconds that deals magic damage. Organic Deconstruction Researches enemy champions causing them to take true damage instead.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VelkozR.png"
      }
    }
  },
  {
    "name": "Vex",
    "class": "the Gloomist",
    "id": "Vex",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Vex.png",
    "abilities": {
      "Q": {
        "name": "Mistral Bolt",
        "description": "Launch a damaging missile that accelerates mid-flight.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VexQ.png"
      },
      "W": {
        "name": "Personal Space",
        "description": "Gain a shield and damage nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VexW.png"
      },
      "E": {
        "name": "Looming Darkness",
        "description": "Summon a damaging and slowing zone that applies Gloom to enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VexE.png"
      },
      "R": {
        "name": "Shadow Surge",
        "description": "Fire a missile that marks an enemy champion.  Recast to dash to them and deal damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VexR.png"
      }
    }
  },
  {
    "name": "Vi",
    "class": "the Piltover Enforcer",
    "id": "Vi",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Vi.png",
    "abilities": {
      "Q": {
        "name": "Vault Breaker",
        "description": "Vi charges her gauntlets and unleashes a vault shattering punch, carrying her forward. Enemies she hits are knocked back and receive a stack of Denting Blows.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViQ.png"
      },
      "W": {
        "name": "Denting Blows",
        "description": "Vi's punches break her opponent's Armor, dealing bonus damage and granting her Attack Speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViW.png"
      },
      "E": {
        "name": "Relentless Force",
        "description": "Vi's next attack blasts through her target, dealing damage to enemies behind it.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViE.png"
      },
      "R": {
        "name": "Cease and Desist",
        "description": "Vi runs down an enemy, knocking aside anyone in the way. When she reaches her target she knocks it into the air, jumps after it, and slams it back into the ground.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViR.png"
      }
    }
  },
  {
    "name": "Viego",
    "class": "The Ruined King",
    "id": "Viego",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Viego.png",
    "abilities": {
      "Q": {
        "name": "Blade of the Ruined King",
        "description": "Viego's spectral blade passively deals bonus percent current Health damage <OnHit>On-Hit</OnHit> and strikes twice vs. enemies he recently hit with an Ability, stealing Health.<br><br>Viego can activate this Ability to thrust his zweihander forward, impaling enemies in front of him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViegoQ.png"
      },
      "W": {
        "name": "Spectral Maw",
        "description": "Viego charges up before dashing forward, releasing a ball of concentrated Black Mist that stuns the first enemy hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViegoW.png"
      },
      "E": {
        "name": "Harrowed Path",
        "description": "Viego commands the Black Mist to haunt and surround a piece of terrain. Viego can hide in the Mist as a wraith, gaining camouflage, Move Speed, and Attack Speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViegoE.png"
      },
      "R": {
        "name": "Heartbreaker",
        "description": "Viego teleports to a nearby location and executes an enemy champion on arrival, piercing their heart and causing a destructive shockwave around them that knocks away their allies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViegoR.png"
      }
    }
  },
  {
    "name": "Viktor",
    "class": "the Herald of the Arcane",
    "id": "Viktor",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Viktor.png",
    "abilities": {
      "Q": {
        "name": "Siphon Power",
        "description": "Viktor blasts an enemy unit with magic damage, which grants him a shield and empowers his next basic attack.<br><br>Augment: Siphon Power's shield is increased by 60% and Viktor gains bonus move speed after casting the Ability.<br>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViktorQ.png"
      },
      "W": {
        "name": "Gravity Field",
        "description": "Viktor conjures a heavy gravitational field that slows enemies caught within its radius. Enemies who stay in the field for too long become stunned.<br><br>Augment: Viktor's spells apply a slow to enemies.<br>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViktorW.png"
      },
      "E": {
        "name": "Hextech Ray",
        "description": "Viktor uses his biomechanical arm to fire a Hextech Ray that cuts across the field in a line, dealing damage to all enemies in its path.<br><br>Augment: An explosion follows in the Hextech Ray's wake, dealing magic damage.<br>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViktorE.png"
      },
      "R": {
        "name": "Arcane Storm",
        "description": "Viktor conjures an Arcane Storm on the field, dealing magic damage and interrupting enemy channels. The storm periodically does magic damage to all nearby enemies and can be redirected by Viktor.<br><br>Augment: The Arcane Storm moves 25% faster, and whenever champions die after taking damage from it, the storm grows and increases in its duration.<br><br>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ViktorR.png"
      }
    }
  },
  {
    "name": "Vladimir",
    "class": "the Crimson Reaper",
    "id": "Vladimir",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Vladimir.png",
    "abilities": {
      "Q": {
        "name": "Transfusion",
        "description": "Vladimir steals life from the target enemy. When Vladimir's resource is full, Transfusion will benefit from massively increased damage and healing for a brief time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VladimirQ.png"
      },
      "W": {
        "name": "Sanguine Pool",
        "description": "Vladimir sinks into a pool of blood, becoming untargetable for 2 seconds. Additionally, enemies on the pool are slowed and Vladimir siphons life from them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VladimirSanguinePool.png"
      },
      "E": {
        "name": "Tides of Blood",
        "description": "Vladimir pays his own health to charge up a reservoir of blood which, when released, deals damage in the area around him but can be blocked by enemy units.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VladimirE.png"
      },
      "R": {
        "name": "Hemoplague",
        "description": "Vladimir infects an area with a virulent plague. Affected enemies take increased damage for the duration. After a few seconds, Hemoplague deals magic damage to infected enemies and heals Vladimir for each enemy Champion hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VladimirHemoplague.png"
      }
    }
  },
  {
    "name": "Volibear",
    "class": "the Relentless Storm",
    "id": "Volibear",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Volibear.png",
    "abilities": {
      "Q": {
        "name": "Thundering Smash",
        "description": "Volibear gains speed towards enemies, <status>Stunning</status> and damaging the first one he Attacks.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VolibearQ.png"
      },
      "W": {
        "name": "Frenzied Maul",
        "description": "Volibear damages an enemy, applying on-hit effects and marking them.  Casting this ability again on the same target deals bonus damage and Heals Volibear.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VolibearW.png"
      },
      "E": {
        "name": "Sky Splitter",
        "description": "Volibear summons a lightning bolt at a location, dealing damage and Slowing enemies while granting Volibear a Shield if he's inside the blast radius.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VolibearE.png"
      },
      "R": {
        "name": "Stormbringer",
        "description": "Volibear leaps to a target location, Slowing and damaging enemies beneath him while gaining bonus Health.  Enemy towers near his landing location become temporarily disabled.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/VolibearR.png"
      }
    }
  },
  {
    "name": "Warwick",
    "class": "the Uncaged Wrath of Zaun",
    "id": "Warwick",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Warwick.png",
    "abilities": {
      "Q": {
        "name": "Jaws of the Beast",
        "description": "Warwick lunges forward and bites his target, dealing damage based on their maximum health and healing for damage dealt.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/WarwickQ.png"
      },
      "W": {
        "name": "Blood Hunt",
        "description": "Warwick senses enemies below 50% health, gaining Move Speed toward and attack speed against them. When they fall below 25% health, he frenzies and these bonuses triple.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/WarwickW.png"
      },
      "E": {
        "name": "Primal Howl",
        "description": "Warwick gains damage reduction for 2.5 seconds. At the end, or if re-activated, he howls, causing nearby enemies to flee for 1 second.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/WarwickE.png"
      },
      "R": {
        "name": "Infinite Duress",
        "description": "Warwick leaps in a direction (scaling with his bonus Move Speed), suppressing the first champion he collides with for 1.5 seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/WarwickR.png"
      }
    }
  },
  {
    "name": "Xayah",
    "class": "the Rebel",
    "id": "Xayah",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Xayah.png",
    "abilities": {
      "Q": {
        "name": "Double Daggers",
        "description": "Xayah throws two damaging daggers that also drop Feathers she can recall.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XayahQ.png"
      },
      "W": {
        "name": "Deadly Plumage",
        "description": "Xayah creates a storm of blades that increase her Attack Speed and damage while also granting her Move Speed if she attacks a champion.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XayahW.png"
      },
      "E": {
        "name": "Bladecaller",
        "description": "Xayah calls back all her dropped Feathers dealing damage and rooting enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XayahE.png"
      },
      "R": {
        "name": "Featherstorm",
        "description": "Xayah leaps into the air becoming untargetable and throwing out a fan of daggers, dropping Feathers she can recall.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XayahR.png"
      }
    }
  },
  {
    "name": "Xerath",
    "class": "the Magus Ascendant",
    "id": "Xerath",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Xerath.png",
    "abilities": {
      "Q": {
        "name": "Arcanopulse",
        "description": "Fires a long-range beam of energy, dealing magic damage to all targets hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XerathArcanopulseChargeUp.png"
      },
      "W": {
        "name": "Eye of Destruction",
        "description": "Calls down a barrage of arcane energy, slowing and dealing magic damage to all enemies in an area. Targets in the middle receive additional damage and a stronger slow.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XerathArcaneBarrage2.png"
      },
      "E": {
        "name": "Shocking Orb",
        "description": "Deals magic damage to an enemy and stuns them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XerathMageSpear.png"
      },
      "R": {
        "name": "Rite of the Arcane",
        "description": "Xerath immobilizes himself and gains numerous long-range barrages.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XerathLocusOfPower2.png"
      }
    }
  },
  {
    "name": "Xin Zhao",
    "class": "the Seneschal of Demacia",
    "id": "XinZhao",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/XinZhao.png",
    "abilities": {
      "Q": {
        "name": "Three Talon Strike",
        "description": "Xin Zhao's next 3 standard attacks deal increased damage with the third attack knocking an opponent into the air.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XinZhaoQ.png"
      },
      "W": {
        "name": "Wind Becomes Lightning",
        "description": "Xin Zhao slashes in front of himself with his spear, then thrusts it forward, slowing affected enemies and marking them as Challenged.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XinZhaoW.png"
      },
      "E": {
        "name": "Audacious Charge",
        "description": "Xin Zhao charges to an enemy, gaining increased Attack Speed and dealing damage to all enemies in the area, slowing them briefly. This Ability gains increased range against Challenged targets.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XinZhaoE.png"
      },
      "R": {
        "name": "Crescent Guard",
        "description": "Xin Zhao passively challenges an enemy he damaged recently. When activated, Xin Zhao deals damage to nearby enemies based on their current Health and knocks non-challenged targets back, becoming impervious to damage dealt by champions outside of the circle created.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/XinZhaoR.png"
      }
    }
  },
  {
    "name": "Yasuo",
    "class": "the Unforgiven",
    "id": "Yasuo",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Yasuo.png",
    "abilities": {
      "Q": {
        "name": "Steel Tempest",
        "description": "Thrusts forward, damaging all enemies in a line.<br><br>On hit, grants a stack of Gathering Storm for a few seconds. At 2 stacks, Steel Tempest fires a whirlwind that knocks <font color='#6655CC'>Airborne</font>.<br><br>Steel Tempest is treated as a basic attack and scales with all the same things.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YasuoQ1Wrapper.png"
      },
      "W": {
        "name": "Wind Wall",
        "description": "Creates a moving wall that blocks all enemy projectiles for 4 seconds.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YasuoW.png"
      },
      "E": {
        "name": "Sweeping Blade",
        "description": "Dashes through target enemy, dealing magic damage. Each cast increases subsequent dash's damage, up to a max amount.<br><br>Cannot be re-cast on the same enemy for a few seconds.<br><br><font color='#99FF99'>If Steel Tempest is cast while dashing, it will strike as a circle.</font>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YasuoE.png"
      },
      "R": {
        "name": "Last Breath",
        "description": "Blinks to an <factionIonia1>Airborne</factionIonia1> enemy champion, dealing physical damage and holding all <factionIonia1>Airborne</factionIonia1> enemies in the area in the air. Grants maximum Flow but resets all stacks of Gathering Storm.<br><br>For a moderate time afterwards, Yasuo's critical strikes gain significant Bonus Armor Penetration.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YasuoR.png"
      }
    }
  },
  {
    "name": "Yone",
    "class": "the Unforgotten",
    "id": "Yone",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Yone.png",
    "abilities": {
      "Q": {
        "name": "Mortal Steel",
        "description": "Thrusts forward, damaging all enemies in a line.<br><br>On hit, grants a stack of Gathering Storm for a few seconds. At 2 stacks, Mortal Steel dashes Yone forward with a gust of wind knocking enemies <status>Airborne</status>.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YoneQ.png"
      },
      "W": {
        "name": "Spirit Cleave",
        "description": "Cleaves forward, damaging all enemies in a cone. Grants a shield to Yone, the value is increased by the number of champions hit by the swipe.<br><br>Spirit Cleave's cooldown and cast time scale with attack speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YoneW.png"
      },
      "E": {
        "name": "Soul Unbound",
        "description": "Yone's spirit leaves his body behind, gaining Move Speed. When this ability ends, Yone's spirit is forced back to his body and he repeats a portion of the damage he dealt as a spirit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YoneE.png"
      },
      "R": {
        "name": "Fate Sealed",
        "description": "Yone blinks behind the last champion in a line with a slash so powerful it pulls all enemies hit towards him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YoneR.png"
      }
    }
  },
  {
    "name": "Yorick",
    "class": "Shepherd of Souls",
    "id": "Yorick",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Yorick.png",
    "abilities": {
      "Q": {
        "name": "Last Rites",
        "description": "Yorick deals bonus damage on his next attack and heals himself. If the target is a champion or large monster or if the target dies, a grave will be dug.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YorickQ.png"
      },
      "W": {
        "name": "Dark Procession",
        "description": "Yorick summons a destructible wall at target location that will block enemy movement.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YorickW.png"
      },
      "E": {
        "name": "Mourning Mist",
        "description": "Yorick throws a globule of Black Mist that reduces armor, damages, slows and marks enemies. Summoned units gain move speed when moving towards marked targets. ",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YorickE.png"
      },
      "R": {
        "name": "Eulogy of the Isles",
        "description": "Yorick summons the Maiden of the Mist that causes Yorick's attacks against the Maiden's target to deal bonus damage. The Maiden will also automatically raise Walkers from dead enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YorickR.png"
      }
    }
  },
  {
    "name": "Yunara",
    "class": "the Unbroken Faith",
    "id": "Yunara",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Yunara.png",
    "abilities": {
      "Q": {
        "name": "Cultivation of Spirit",
        "description": "Yunara gains Attack Speed, bonus damage On-Hit, and her Attacks spread to nearby enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YunaraQ.png"
      },
      "W": {
        "name": "Arc of Judgment | Arc of Ruin",
        "description": "Yunara fires a spinning prayer bead that deals damage and slows enemies. While in her Transcendent State she instead fires off a laser that deals damage and slows enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YunaraW.png"
      },
      "E": {
        "name": "Kanmei's Steps | Untouchable Shadow",
        "description": "Yunara gains Move Speed and becomes Ghosted. While in her Transcendent State she instead dashes in a direction.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YunaraE.png"
      },
      "R": {
        "name": "Transcend One's Self",
        "description": "Yunara enters a Transcendent State that upgrades her basic Abilities.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YunaraR.png"
      }
    }
  },
  {
    "name": "Yuumi",
    "class": "the Magical Cat",
    "id": "Yuumi",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Yuumi.png",
    "abilities": {
      "Q": {
        "name": "Prowling Projectile",
        "description": "Yuumi fires a missile, dealing damage and slowing first target hit. It deals bonus damage and an enchanced slow if it takes at least 1.35 seconds to get to its target. While on her Best Friend, the slow is always enhanced and grants bonus On-Hit damage to her ally.<br><br>While Attached, the missile can be controlled with your cursor for a brief period.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YuumiQ.png"
      },
      "W": {
        "name": "You and Me!",
        "description": "Yuumi dashes to a target ally, becoming untargetable from everything except turrets. While on her Best Friend, she gains Heal & Shield Power and grants her Ally On-Hit healing.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YuumiW.png"
      },
      "E": {
        "name": "Zoomies",
        "description": "Shields Yuumi and boosts Move Speed and Attack Speed. If she's attached, she passes it to her ally instead.<br>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YuumiE.png"
      },
      "R": {
        "name": "Final Chapter",
        "description": "Yuumi channels five waves that damage enemies and heal allies. Yuumi can move, attach, and cast Zoomies! while channeling. While on her Best Friend, this spell also follows her mouse.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/YuumiR.png"
      }
    }
  },
  {
    "name": "Zaahen",
    "class": "The Unsundered",
    "id": "Zaahen",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Zaahen.png",
    "abilities": {
      "Q": {
        "name": "The Darkin Glaive",
        "description": "Zaahen slashes twice on his next attack, dealing bonus damage and healing himself. Zaahen can recast this ability to have his next attack deal bonus damage and knock up his target.<br>",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZaahenQ.png"
      },
      "W": {
        "name": "Dreaded Return",
        "description": "Zaahen stabs in a direction, damaging enemies hit, then pulls them toward him.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZaahenW.png"
      },
      "E": {
        "name": "Aureate Rush",
        "description": "Zaahen dashes to a location and slices around himself.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZaahenE.png"
      },
      "R": {
        "name": "Grim Deliverance",
        "description": "Zaahen rises then stabs downward, damaging enemies and healing for a portion of the damage dealt.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZaahenR.png"
      }
    }
  },
  {
    "name": "Zac",
    "class": "the Secret Weapon",
    "id": "Zac",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Zac.png",
    "abilities": {
      "Q": {
        "name": "Stretching Strikes",
        "description": "Zac stretches an arm, grabbing an enemy. Attacking a different enemy will cause him to throw both targets towards each other.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZacQ.png"
      },
      "W": {
        "name": "Unstable Matter",
        "description": "Zac explodes outward towards nearby enemies, dealing a percentage of their maximum health as magic damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZacW.png"
      },
      "E": {
        "name": "Elastic Slingshot",
        "description": "Zac attaches his arms to the ground and stretches back, launching himself forward.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZacE.png"
      },
      "R": {
        "name": "Let's Bounce!",
        "description": "Zac bounces four times, knocking up enemies hit and slowing them.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZacR.png"
      }
    }
  },
  {
    "name": "Zed",
    "class": "the Master of Shadows",
    "id": "Zed",
    "ranged": false,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Zed.png",
    "abilities": {
      "Q": {
        "name": "Razor Shuriken",
        "description": "Zed and his shadows throw their shurikens.<br><br>Each shuriken deals damage to every enemy hit.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZedQ.png"
      },
      "W": {
        "name": "Living Shadow",
        "description": "<font color='#FF9900'>Passive:</font> Zed gains energy whenever he and his shadows strike an enemy with the same ability. Energy can only be gained once per cast ability.<br><br><font color='#FF9900'>Active:</font> Zed's shadow dashes forward, remaining in place for a few seconds. Reactivating Living Shadow will cause Zed to switch positions with this shadow.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZedW.png"
      },
      "E": {
        "name": "Shadow Slash",
        "description": "Zed and his Shadows slash, dealing damage to nearby enemies. Enemies hit by a Shadow's slash are slowed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZedE.png"
      },
      "R": {
        "name": "Death Mark",
        "description": "Zed becomes untargetable and dashes to an enemy champion, marking them. After 3 seconds the mark triggers, repeating a portion of all the damage Zed dealt to the target while they were marked.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZedR.png"
      }
    }
  },
  {
    "name": "Zeri",
    "class": "The Spark of Zaun",
    "id": "Zeri",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Zeri.png",
    "abilities": {
      "Q": {
        "name": "Burst Fire",
        "description": "Burst Fire shoots a burst of 7 rounds that deal attack damage to the first enemy hit. This Ability is treated as an Attack.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZeriQ.png"
      },
      "W": {
        "name": "Ultrashock Laser",
        "description": "Zeri fires an electric pulse that slows and damages the first enemy hit. If the pulse hits a wall it expands into a long range laser.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZeriW.png"
      },
      "E": {
        "name": "Spark Surge",
        "description": "Zeri dashes a short distance and energizes her next 3 shots of Burst Fire, causing them to pierce through enemies. She will vault and grind over any terrain she touches.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZeriE.png"
      },
      "R": {
        "name": "Lightning Crash",
        "description": "Zeri discharges a nova of electricity and overcharges herself, gaining increased damage and stacking Move Speed that refreshes and gets stronger every time she hits an enemy champion. While overcharged, Burst fire becomes a faster triple shot that chains lightning between enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZeriR.png"
      }
    }
  },
  {
    "name": "Ziggs",
    "class": "the Hexplosives Expert",
    "id": "Ziggs",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Ziggs.png",
    "abilities": {
      "Q": {
        "name": "Bouncing Bomb",
        "description": "Ziggs throws a bouncing bomb that deals magic damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZiggsQ.png"
      },
      "W": {
        "name": "Satchel Charge",
        "description": "Ziggs flings an explosive charge that detonates after a delay, or when this ability is activated again. The explosion deals magic damage to enemies, knocking them away. Ziggs is also knocked away, but takes no damage. <br><br>Ziggs can use the Satchel to hexplode vulnerable enemy turrets.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZiggsW.png"
      },
      "E": {
        "name": "Hexplosive Minefield",
        "description": "Ziggs scatters proximity mines that detonate on enemy contact, dealing magic damage and slowing. Successive mine detonations on the same target deal reduced damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZiggsE.png"
      },
      "R": {
        "name": "Mega Inferno Bomb",
        "description": "Ziggs deploys his ultimate creation, the Mega Inferno Bomb, hurling it an enormous distance. Enemies in the primary blast zone take more damage than those farther away.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZiggsR.png"
      }
    }
  },
  {
    "name": "Zilean",
    "class": "the Chronokeeper",
    "id": "Zilean",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Zilean.png",
    "abilities": {
      "Q": {
        "name": "Time Bomb",
        "description": "Tosses a bomb to target area that sticks to units that come near it (prioritizes Champions). It detonates after 3 seconds, dealing area of effect damage. If a Time Bomb is detonated early by another Time Bomb, it also stuns enemies.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZileanQ.png"
      },
      "W": {
        "name": "Rewind",
        "description": "Zilean can prepare himself for future confrontations, reducing the cooldowns of his other basic abilities.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZileanW.png"
      },
      "E": {
        "name": "Time Warp",
        "description": "Zilean bends time around any unit, decreasing an enemy's Move Speed or increasing an ally's Move Speed for a short time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/TimeWarp.png"
      },
      "R": {
        "name": "Chronoshift",
        "description": "Zilean places a protective time rune on an allied champion, teleporting the champion back in time if they take lethal damage.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ChronoShift.png"
      }
    }
  },
  {
    "name": "Zoe",
    "class": "the Aspect of Twilight",
    "id": "Zoe",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Zoe.png",
    "abilities": {
      "Q": {
        "name": "Paddle Star!",
        "description": "Zoe fires a missile that she can redirect in flight. Deals more damage the longer it flies in a straight line.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZoeQ.png"
      },
      "W": {
        "name": "Spell Thief",
        "description": "Zoe can pick up the remnants of enemy summoner spell and active item casts and cast them once herself. Whenever she casts a summoner spell, she gains 3 missiles that fire at the nearest target.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZoeW.png"
      },
      "E": {
        "name": "Sleepy Trouble Bubble",
        "description": "Causes the target to become drowsy, then fall asleep. While asleep, the target's Magic Resist is reduced. The first source of damage that breaks the sleep is doubled, up to a cap.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZoeE.png"
      },
      "R": {
        "name": "Portal Jump",
        "description": "Blink to a nearby position for 1 second. Then blink back.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZoeR.png"
      }
    }
  },
  {
    "name": "Zyra",
    "class": "Rise of the Thorns",
    "id": "Zyra",
    "ranged": true,
    "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/champion/Zyra.png",
    "abilities": {
      "Q": {
        "name": "Deadly Spines",
        "description": "Thick vines spread through the ground and explode into spines, dealing magic damage to enemies within the area. If cast near a seed, Deadly Spines grows a Thorn Spitter plant, which fires at enemies from afar.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZyraQ.png"
      },
      "W": {
        "name": "Rampant Growth",
        "description": "Zyra plants a seed, lasting up to 60 seconds. Deadly Spines and Grasping Roots cast near seeds will turn them into plants who fight for Zyra. Zyra can store multiple seeds at once, and killing enemies reduces Rampant Growth's recharge time.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZyraW.png"
      },
      "E": {
        "name": "Grasping Roots",
        "description": "Zyra sends forth vines through the ground to ensnare her target, dealing damage and rooting enemies they come across. If cast near a seed, Grasping Roots grows a Vine Lasher, whose short range attacks reduce enemy Move Speed.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZyraE.png"
      },
      "R": {
        "name": "Stranglethorns",
        "description": "Zyra summons a twisted thicket at her target location, dealing damage to enemies as it expands and knocking them airborne as it contracts. Plants within the thicket are enraged.",
        "icon": "https://ddragon.leagueoflegends.com/cdn/16.4.1/img/spell/ZyraR.png"
      }
    }
  }
]
